Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
    Если ИменаПараметровСеанса <> Неопределено Тогда
        ВызватьИсключение "ordinary-request:" + ИменаПараметровСеанса[0];
    КонецЕсли;
    НачальноеИспользованиеПробы = ПараметрыСеанса.ИспользованиеРазделителяПробы;
    НачальноеЗначениеПробы = ПараметрыСеанса.ЗначениеРазделителяПробы;
    ПараметрыСеанса.НаблюдениеСтарта = "USE=" + ?(НачальноеИспользованиеПробы, "YES", "NO")
        + ";VALUE=[" + Строка(НачальноеЗначениеПробы) + "]";
КонецПроцедуры
