Попытка
АргументПробы = 2024;
РезультатПробы = ЗамерыТранзитивногоРодителя.Создание73(АргументПробы);
Сообщить("image.native.date_creation.73.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.date_creation.73.reference=" + Формат(АргументПробы, "ЧГ=0"));
Исключение
Сообщить("image.native.date_creation.73.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = 2024;
РезультатПробы = ЗамерыТранзитивногоРодителя.Создание74(АргументПробы);
Сообщить("image.native.date_creation.74.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.date_creation.74.reference=" + Формат(АргументПробы, "ЧГ=0"));
Исключение
Сообщить("image.native.date_creation.74.failure=" + ОписаниеОшибки());
КонецПопытки;
