Попытка
    ОбъектПробы = Обработки.Замеры.Создать();
    Сообщить("synonym.object.type" + Символ(9) + Строка(ТипЗнч(ОбъектПробы)));
    Сообщить("synonym.section.type" + Символ(9) + Строка(ТипЗнч(ОбъектПробы.СтрокиПробы)));
    Сообщить("synonym.row.type" + Символ(9) + Строка(ТипЗнч(ОбъектПробы.СтрокиПробы[0])));
    Сообщить("synonym.owner.name" + Символ(9) + ОбъектПробы.Метаданные().Имя);
    Сообщить("synonym.type.ru" + Символ(9) + Строка(Тип("ОбработкаОбъект.Замеры") = ТипЗнч(ОбъектПробы)));
    Сообщить("synonym.type.en" + Символ(9) + Строка(Тип("DataProcessorObject.Замеры") = ТипЗнч(ОбъектПробы)));
Исключение
    Сообщить("synonym.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
