Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0001-0000-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.0.1" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.0.1.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0001-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.0.2" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.0.2.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0001-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.0.3" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.0.3.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000001"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.0.4" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.0.4.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0001-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0001-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.1.2" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.1.2.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0001-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0001-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.1.3" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.1.3.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0001-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000001"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.1.4" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.1.4.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0001-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0001-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.2.3" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.2.3.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0001-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000001"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.2.4" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.2.4.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0001-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000001"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("groups.3.4" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
Исключение
    Сообщить("groups.3.4.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
