Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.empty.small.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.empty.small.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.empty.small.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.empty.small.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000001-0000-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000100-0000-0000-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.first.word.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.first.word.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.first.word.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.first.word.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0001-0000-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0100-0000-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.second.word.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.second.word.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.second.word.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.second.word.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0001-0000-000000000000"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0100-0000-000000000000"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.third.word.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.third.word.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.third.word.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.third.word.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000001"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000100"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.tail.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.tail.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.tail.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.tail.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    СсылкаПерваяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("11111111-1111-4111-8111-111111111111"));
    СсылкаВтораяПробы = Документы.ЗамерДокумента.ПолучитьСсылку(Новый УникальныйИдентификатор("11111111-1111-4111-8111-111111111111"));
    МоментПервыйПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаПерваяПробы);
    МоментВторойПробы = Новый МоментВремени(Дата(2024,1,2), СсылкаВтораяПробы);
    Сообщить("references.same.forward" + Символ(9) + Строка(МоментПервыйПробы.Сравнить(МоментВторойПробы)));
    Сообщить("references.same.reverse" + Символ(9) + Строка(МоментВторойПробы.Compare(МоментПервыйПробы)));
    Сообщить("references.same.equal" + Символ(9) + Строка(?(МоментПервыйПробы = МоментВторойПробы,1,0)));
Исключение
    Сообщить("references.same.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
