Попытка
АргументПробы = 100;
РезультатПробы = ЗамерыТранзитивногоРодителя.Значение103(АргументПробы);
Сообщить("image.native.extra.103.result=" + Строка(?(РезультатПробы, 1, 0)));
Исключение
Сообщить("image.native.extra.103.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = 100;
РезультатПробы = ЗамерыТранзитивногоРодителя.Значение104(АргументПробы);
Сообщить("image.native.extra.104.result=" + Строка(?(РезультатПробы, 1, 0)));
Исключение
Сообщить("image.native.extra.104.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = "Число";
РезультатПробы = ЗамерыТранзитивногоРодителя.Значение108(АргументПробы);
Сообщить("image.native.extra.108.result=" + Строка(?(РезультатПробы, 1, 0)));
Исключение
Сообщить("image.native.extra.108.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = 100;
РезультатПробы = ЗамерыТранзитивногоРодителя.Значение110(АргументПробы);
Сообщить("image.native.extra.110.result=" + Строка(?(РезультатПробы, 1, 0)));
Исключение
Сообщить("image.native.extra.110.failure=" + ОписаниеОшибки());
КонецПопытки;
