А = 1;
Если А = 1 Тогда Сообщить("число"); КонецЕсли;

А = "строка";
Если А = "строка" Тогда Сообщить("строка"); КонецЕсли;

А = '20240102030405';
Если А = '20240102030405' Тогда Сообщить("дата"); КонецЕсли;

А = Истина;
Если А = Истина Тогда Сообщить("булево"); КонецЕсли;
Если А = 1 Тогда Сообщить("булево-число"); КонецЕсли;

А = 1;
Если А = Истина Тогда Сообщить("число-булево"); КонецЕсли;

А = Неопределено;
Если А = Неопределено Тогда Сообщить("неопределено"); КонецЕсли;

А = Null;
Если А = Null Тогда Сообщить("null"); КонецЕсли;

А = Истина;
Попытка
    Если А < 1 Тогда
        Сообщить("недостижимо");
    КонецЕсли;
Исключение
    Сообщить("ошибка сравнения");
КонецПопытки;
