Функция Проверить() Экспорт
	УстановитьБезопасныйРежим(Истина);
	СсылкаНаМодуль = Вычислить("ЗамерыФоновыхЗаданийДвусторонние");
	Если ТипЗнч(СсылкаНаМодуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение "Вычислить вернуло неверный тип";
	КонецЕсли;
	Если ТипЗнч(СсылкаНаМодуль) <> Тип("CommonModule") Тогда
		ВызватьИсключение "Английское имя типа не найдено";
	КонецЕсли;
	Если Строка(ТипЗнч(СсылкаНаМодуль)) <> "Common module" Тогда
		ВызватьИсключение "Неверное строковое имя типа";
	КонецЕсли;
	СсылкаНаМодуль.Пустая();
	Возврат "ok";
КонецФункции
