Попытка
    ОбъектОбработчикаПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ДругойОбъектОбработчикаПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.check.handler-replace.result" + Символ(9) + ?(ОбъектОбработчикаПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    Сообщить("business.check.handler-replace.input" + Символ(9) + ОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
    Сообщить("business.check.handler-replace.other" + Символ(9) + ДругойОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
    ОбъектОбработчикаПроверкиБизнесПробы.ТекстПробы = "значение";
    Сообщить("business.check.handler-replace.assigned" + Символ(9) + ?(ОбъектОбработчикаПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    Сообщить("business.check.handler-replace.assigned-input" + Символ(9) + ОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
Исключение
    Сообщить("business.check.handler-replace.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
