Попытка
    ОбъектПроверкиАрностиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.check.arity.default" + Символ(9) + ?(ОбъектПроверкиАрностиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    ОшибкаАрностиПроверкиБизнесПробы = 0;
    Попытка
        РезультатПроверкиАрностиБизнесПробы = Вычислить("ОбъектПроверкиАрностиБизнесПробы.ПроверитьЗаполнение(Новый Массив)");
    Исключение
        ОшибкаАрностиПроверкиБизнесПробы = 1;
    КонецПопытки;
    Сообщить("business.check.arity.1.error" + Символ(9) + ОшибкаАрностиПроверкиБизнесПробы);
    ОшибкаАрностиПроверкиБизнесПробы = 0;
    Попытка
        РезультатПроверкиАрностиБизнесПробы = Вычислить("ОбъектПроверкиАрностиБизнесПробы.ПроверитьЗаполнение(Новый Массив, Новый Массив)");
    Исключение
        ОшибкаАрностиПроверкиБизнесПробы = 1;
    КонецПопытки;
    Сообщить("business.check.arity.2.error" + Символ(9) + ОшибкаАрностиПроверкиБизнесПробы);
    Сообщить("business.check.arity.after-errors" + Символ(9) + ?(ОбъектПроверкиАрностиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
Исключение
    Сообщить("business.check.arity.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
