Перем НаблюдениеПроверкиБизнесПробы;
Функция НаблюдениеПроверкиБизнес() Экспорт
    Возврат НаблюдениеПроверкиБизнесПробы;
КонецФункции
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    НаблюдениеПроверкиБизнесПробы = ?(Отказ, "1", "0") + "|" + Строка(ПроверяемыеРеквизиты.Количество());
    Для Каждого ПутьПроверкиБизнесПробы Из ПроверяемыеРеквизиты Цикл
        НаблюдениеПроверкиБизнесПробы = НаблюдениеПроверкиБизнесПробы + "|" + ПутьПроверкиБизнесПробы;
    КонецЦикла;
    ПроверяемыеРеквизиты.Очистить();
    Отказ = Истина;
КонецПроцедуры
НаблюдениеПроверкиБизнесПробы = "не вызван";
