Попытка
    ОбъектПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.check.default" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    ПоляТекстаБизнесПробы = Новый Массив;
    ПоляТекстаБизнесПробы.Добавить("ТекстПробы");
    Сообщить("business.check.text.empty" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(ПоляТекстаБизнесПробы), 1, 0));
    ОбъектПроверкиБизнесПробы.ТекстПробы = "значение";
    Сообщить("business.check.text.assigned" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(ПоляТекстаБизнесПробы), 1, 0));
    ПоляФлагаБизнесПробы = Новый Массив;
    ПоляФлагаБизнесПробы.Добавить("ФлагПробы");
    Сообщить("business.check.flag.false" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(ПоляФлагаБизнесПробы), 1, 0));
    ОбъектПроверкиБизнесПробы.ФлагПробы = Истина;
    Сообщить("business.check.flag.true" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(ПоляФлагаБизнесПробы), 1, 0));
    Сообщить("business.check.empty-array" + Символ(9) + ?(ОбъектПроверкиБизнесПробы.ПроверитьЗаполнение(Новый Массив), 1, 0));
Исключение
    Сообщить("business.check.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
