Попытка
    ОбъектПсевдонимаПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.check.alias.ru" + Символ(9) + ?(ОбъектПсевдонимаПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    Сообщить("business.check.alias.en" + Символ(9) + ?(ОбъектПсевдонимаПроверкиБизнесПробы.CheckFilling(), 1, 0));
    Сообщить("business.check.alias.ru-folded" + Символ(9) + ?(ОбъектПсевдонимаПроверкиБизнесПробы.проверитьзаполнение(), 1, 0));
    Сообщить("business.check.alias.en-folded" + Символ(9) + ?(ОбъектПсевдонимаПроверкиБизнесПробы.checkfilling(), 1, 0));
Исключение
    Сообщить("business.check.alias.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
