Попытка
    ОбъектОбработчикаПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ДругойОбъектОбработчикаПроверкиБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.check.handler.result" + Символ(9) + ?(ОбъектОбработчикаПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    Сообщить("business.check.handler.input" + Символ(9) + ОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
    Сообщить("business.check.handler.other" + Символ(9) + ДругойОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
    ОбъектОбработчикаПроверкиБизнесПробы.ТекстПробы = "значение";
    Сообщить("business.check.handler.assigned" + Символ(9) + ?(ОбъектОбработчикаПроверкиБизнесПробы.ПроверитьЗаполнение(), 1, 0));
    Сообщить("business.check.handler.assigned-input" + Символ(9) + ОбъектОбработчикаПроверкиБизнесПробы.НаблюдениеПроверкиБизнес());
Исключение
    Сообщить("business.check.handler.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
