Перем ЧтениеЗагрузкиПробы, ЗаписьЗагрузкиПробы, ЧтениеАвтоПробы, ЗаписьАвтоПробы;
Функция СостояниеОбмена() Экспорт Возврат ЧтениеЗагрузкиПробы + "|" + ЗаписьЗагрузкиПробы + "|" + ЧтениеАвтоПробы + "|" + ЗаписьАвтоПробы; КонецФункции
ЧтениеЗагрузкиПробы = "rejected";
Попытка ЧтениеЗагрузкиПробы = ?(ОбменДанными.Загрузка, "1", "0"); Исключение КонецПопытки;
ЗаписьЗагрузкиПробы = "accepted";
Попытка DataExchange.Load = Истина; Исключение ЗаписьЗагрузкиПробы = "rejected"; КонецПопытки;
ЧтениеАвтоПробы = "rejected";
Попытка ЧтениеАвтоПробы = ?(ОбменДанными.Получатели.АвтоЗаполнение, "1", "0"); Исключение КонецПопытки;
ЗаписьАвтоПробы = "accepted";
Попытка DataExchange.Recipients.AutoFill = Ложь; Исключение ЗаписьАвтоПробы = "rejected"; КонецПопытки;
