Попытка
    ПустойБизнесОбъектПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ПустойБизнесОбъектПробы.Заполнить(Новый Структура);
    Сообщить("business.fill.empty.date" + Символ(9) + ?(ПустойБизнесОбъектПробы.Дата = Дата(1, 1, 1), 1, 0));
    Сообщить("business.fill.empty.number" + Символ(9) + ?(ПустойБизнесОбъектПробы.Номер = "", 1, 0));
    Сообщить("business.fill.empty.is-new" + Символ(9) + ?(ПустойБизнесОбъектПробы.ЭтоНовый(), 1, 0));
    ИзмененныйБизнесОбъектПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ИзмененныйБизнесОбъектПробы.Дата = Дата(2026, 10, 6, 12, 34, 56);
    ИзмененныйБизнесОбъектПробы.Номер = "контроль";
    ИзмененныйБизнесОбъектПробы.ПометкаУдаления = Истина;
    ИзмененныйБизнесОбъектПробы.Стартован = Истина;
    ИзмененныйБизнесОбъектПробы.Завершен = Истина;
    ИзмененныйБизнесОбъектПробы.ДополнительныеСвойства.Вставить("Контроль", 42);
    ИзмененныйБизнесОбъектПробы.Fill(Новый Structure);
    Сообщить("business.fill.changed.date" + Символ(9) + ?(ИзмененныйБизнесОбъектПробы.Дата = Дата(2026, 10, 6, 12, 34, 56), 1, 0));
    Сообщить("business.fill.changed.number" + Символ(9) + ?(ИзмененныйБизнесОбъектПробы.Номер = "контроль", 1, 0));
    Сообщить("business.fill.changed.deletion-mark" + Символ(9) + ?(ИзмененныйБизнесОбъектПробы.ПометкаУдаления, 1, 0));
    Сообщить("business.fill.changed.started" + Символ(9) + ?(ИзмененныйБизнесОбъектПробы.Стартован, 1, 0));
    Сообщить("business.fill.changed.completed" + Символ(9) + ?(ИзмененныйБизнесОбъектПробы.Завершен, 1, 0));
    Сообщить("business.fill.changed.additional" + Символ(9) + ИзмененныйБизнесОбъектПробы.ДополнительныеСвойства.Контроль);
Исключение
    Сообщить("business.fill.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
