Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    Если ДанныеЗаполнения.РежимПробы = "own" Тогда
        ТекстПробы = "обработчик";
        ФлагПробы = Ложь;
    ИначеЕсли ДанныеЗаполнения.РежимПробы = "mutate" Тогда
        ДанныеЗаполнения.ТекстПробы = "изменено";
        ДанныеЗаполнения.ФлагПробы = Ложь;
    ИначеЕсли ДанныеЗаполнения.РежимПробы = "replace" Тогда
        ДанныеЗаполнения = Новый Структура("ТекстПробы,ФлагПробы", "замена", Ложь);
    ИначеЕсли ДанныеЗаполнения.РежимПробы = "disable" Тогда
        ТекстПробы = "отключено";
        СтандартнаяОбработка = Ложь;
    КонецЕсли;
КонецПроцедуры
