Перем ЧислоЗаполненийБизнесПробы;
Перем ВходСтандартнойОбработкиБизнесПробы;
Перем ТекстНеопределенБизнесПробы;
Перем ТекстСтрокаБизнесПробы;
Перем ДанныеСтруктураБизнесПробы;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    ЧислоЗаполненийБизнесПробы = ЧислоЗаполненийБизнесПробы + 1;
    ВходСтандартнойОбработкиБизнесПробы = ?(СтандартнаяОбработка, 1, 0);
    ТекстНеопределенБизнесПробы = ?(ТекстЗаполнения = Неопределено, 1, 0);
    ТекстСтрокаБизнесПробы = ?(ТипЗнч(ТекстЗаполнения) = Тип("Строка"), 1, 0);
    ДанныеСтруктураБизнесПробы = ?(ТипЗнч(ДанныеЗаполнения) = Тип("Структура"), 1, 0);
    ДанныеЗаполнения.Вставить("ОтОбработчика", 42);
    ДанныеЗаполнения = Новый Структура("После", 23);
    СтандартнаяОбработка = Ложь;
    Дата = Дата(2026, 10, 6, 12, 34, 56);
КонецПроцедуры

Функция ЧислоЗаполненийПробы() Экспорт
    Возврат ЧислоЗаполненийБизнесПробы;
КонецФункции
Функция ВходСтандартнойОбработкиПробы() Экспорт
    Возврат ВходСтандартнойОбработкиБизнесПробы;
КонецФункции
Функция ТекстНеопределенПробы() Экспорт
    Возврат ТекстНеопределенБизнесПробы;
КонецФункции
Функция ТекстСтрокаПробы() Экспорт
    Возврат ТекстСтрокаБизнесПробы;
КонецФункции
Функция ДанныеСтруктураПробы() Экспорт
    Возврат ДанныеСтруктураБизнесПробы;
КонецФункции

ЧислоЗаполненийБизнесПробы = 0;
