Попытка
    ПустойОбъектСтандартногоЗаполнения = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ПустойОбъектСтандартногоЗаполнения.Заполнить(Новый Структура);
    Сообщить("business.fill.standard.undefined.date.empty" + Символ(9) + ?(ПустойОбъектСтандартногоЗаполнения.Дата = Дата(1, 1, 1), 1, 0));
    Сообщить("business.fill.standard.undefined.number.empty" + Символ(9) + ?(ПустойОбъектСтандартногоЗаполнения.Номер = "", 1, 0));
    НовыйОбъектСтандартногоЗаполнения = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    НовыйОбъектСтандартногоЗаполнения.Fill(Новый Структура("Вход", 1));
    Сообщить("business.fill.standard.new.date.assigned" + Символ(9) + ?(НовыйОбъектСтандартногоЗаполнения.Дата = Дата(2026, 10, 6, 12, 34, 56), 1, 0));
    Сообщить("business.fill.standard.new.number.assigned" + Символ(9) + ?(НовыйОбъектСтандартногоЗаполнения.Номер = "новый", 1, 0));
    Сообщить("business.fill.standard.new.deletion-mark" + Символ(9) + ?(НовыйОбъектСтандартногоЗаполнения.ПометкаУдаления, 1, 0));
    Сообщить("business.fill.standard.new.started" + Символ(9) + ?(НовыйОбъектСтандартногоЗаполнения.Стартован, 1, 0));
    Сообщить("business.fill.standard.new.completed" + Символ(9) + ?(НовыйОбъектСтандартногоЗаполнения.Завершен, 1, 0));
    ИзмененныйОбъектСтандартногоЗаполнения = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ИзмененныйОбъектСтандартногоЗаполнения.Дата = Дата(2025, 1, 2, 3, 4, 5);
    ИзмененныйОбъектСтандартногоЗаполнения.Номер = "старый";
    ИзмененныйОбъектСтандартногоЗаполнения.ПометкаУдаления = Истина;
    ИзмененныйОбъектСтандартногоЗаполнения.Стартован = Истина;
    ИзмененныйОбъектСтандартногоЗаполнения.Завершен = Истина;
    ИзмененныйОбъектСтандартногоЗаполнения.Заполнить(Новый Структура("Вход", 1));
    Сообщить("business.fill.standard.changed.date.retained" + Символ(9) + ?(ИзмененныйОбъектСтандартногоЗаполнения.Дата = Дата(2025, 1, 2, 3, 4, 5), 1, 0));
    Сообщить("business.fill.standard.changed.number.retained" + Символ(9) + ?(ИзмененныйОбъектСтандартногоЗаполнения.Номер = "старый", 1, 0));
    Сообщить("business.fill.standard.changed.deletion-mark" + Символ(9) + ?(ИзмененныйОбъектСтандартногоЗаполнения.ПометкаУдаления, 1, 0));
    Сообщить("business.fill.standard.changed.started" + Символ(9) + ?(ИзмененныйОбъектСтандартногоЗаполнения.Стартован, 1, 0));
    Сообщить("business.fill.standard.changed.completed" + Символ(9) + ?(ИзмененныйОбъектСтандартногоЗаполнения.Завершен, 1, 0));
Исключение
    Сообщить("business.fill.standard.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
