Перем ТипВедущейПриСоздании, ПрисваиваниеВедущейПриСоздании;
Функция СостояниеИнициализации() Экспорт
    Возврат ТипВедущейПриСоздании + "|" + ПрисваиваниеВедущейПриСоздании;
КонецФункции
ТипВедущейПриСоздании = "rejected";
Попытка ТипВедущейПриСоздании = ?(ТипЗнч(ВедущаяЗадача) = Тип("ЗадачаСсылка.ЗамерЗадачи"), "1", "0"); Исключение КонецПопытки;
ПрисваиваниеВедущейПриСоздании = "accepted";
Попытка HeadTask = Неопределено; Исключение ПрисваиваниеВедущейПриСоздании = "rejected"; КонецПопытки;
