Попытка
    ОбъектВедущей = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.head-task.ru.type" + Символ(9) + ТипЗнч(ОбъектВедущей.ВедущаяЗадача));
    Сообщить("business.head-task.en.type" + Символ(9) + ТипЗнч(ОбъектВедущей.HeadTask));
    Сообщить("business.head-task.empty" + Символ(9) + ?(ОбъектВедущей.ВедущаяЗадача.Пустая(), "1", "0"));
    Сообщить("business.head-task.reference" + Символ(9) + ?(ОбъектВедущей.HeadTask = Задачи.ЗамерЗадачи.ПустаяСсылка(), "1", "0"));
    РезультатПрисваивания = "accepted";
    Попытка ОбъектВедущей.ВедущаяЗадача = Неопределено; Исключение РезультатПрисваивания = "rejected"; КонецПопытки;
    Сообщить("business.head-task.undefined" + Символ(9) + РезультатПрисваивания);
    Сообщить("business.head-task.after.undefined.empty" + Символ(9) + ?(ОбъектВедущей.HeadTask.Пустая(), "1", "0"));
    РезультатПрисваивания = "accepted";
    Попытка ОбъектВедущей.HeadTask = "wrong"; Исключение РезультатПрисваивания = "rejected"; КонецПопытки;
    Сообщить("business.head-task.string" + Символ(9) + РезультатПрисваивания);
    Сообщить("business.head-task.after.string.empty" + Символ(9) + ?(ОбъектВедущей.ВедущаяЗадача.Пустая(), "1", "0"));
Исключение
    Сообщить("business.head-task.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
