Попытка
    ОбъектВедущей = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    СсылкаВедущей = Задачи.ЗамерЗадачи.ПолучитьСсылку(Новый УникальныйИдентификатор("47eecebd-0a42-4b49-89e8-c75d7bab30b0"));
    ОбъектВедущей.ВедущаяЗадача = СсылкаВедущей;
    Сообщить("business.head-task.assigned.ru" + Символ(9) + ?(ОбъектВедущей.HeadTask = СсылкаВедущей, "1", "0"));
    ОбъектВедущей.HeadTask = СсылкаВедущей;
    Сообщить("business.head-task.assigned.en" + Символ(9) + ?(ОбъектВедущей.ВедущаяЗадача = СсылкаВедущей, "1", "0"));
    ОбъектВедущей.HeadTask = "wrong";
    Сообщить("business.head-task.wrong.resets" + Символ(9) + ?(ОбъектВедущей.HeadTask.Пустая(), "1", "0"));
    ОбъектВедущей.ВедущаяЗадача = СсылкаВедущей;
    ОбъектВедущей.Read();
    Сообщить("business.head-task.read.resets" + Символ(9) + ?(ОбъектВедущей.HeadTask.Пустая(), "1", "0"));
    Сообщить("business.head-task.read.type" + Символ(9) + ТипЗнч(ОбъектВедущей.ВедущаяЗадача));
Исключение
    Сообщить("business.head-task.reference.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
