Перем СчетчикБизнесПробы;
Перем ОшибкаЧтенияДатыБизнесПробы;
Перем ОшибкаПрисвоенияДатыБизнесПробы;

Функция СчетчикПробы() Экспорт
    Возврат СчетчикБизнесПробы;
КонецФункции

Процедура УвеличитьСчетчикПробы() Экспорт
    СчетчикБизнесПробы = СчетчикБизнесПробы + 1;
КонецПроцедуры

Функция ОшибкаЧтенияДатыПробы() Экспорт
    Возврат ОшибкаЧтенияДатыБизнесПробы;
КонецФункции

Функция ОшибкаПрисвоенияДатыПробы() Экспорт
    Возврат ОшибкаПрисвоенияДатыБизнесПробы;
КонецФункции

СчетчикБизнесПробы = 0;
ОшибкаЧтенияДатыБизнесПробы = 0;
Попытка
    ДатаТелаБизнесПробы = Дата;
Исключение
    ОшибкаЧтенияДатыБизнесПробы = 1;
КонецПопытки;
ОшибкаПрисвоенияДатыБизнесПробы = 0;
Попытка
    Дата = Дата(2026, 10, 6, 1, 2, 3);
Исключение
    ОшибкаПрисвоенияДатыБизнесПробы = 1;
КонецПопытки;
