Попытка
    ПервыйБизнесОбъектПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ВторойБизнесОбъектПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.module.initial" + Символ(9) + ПервыйБизнесОбъектПробы.СчетчикПробы());
    ПервыйБизнесОбъектПробы.УвеличитьСчетчикПробы();
    Сообщить("business.module.first" + Символ(9) + ПервыйБизнесОбъектПробы.СчетчикПробы());
    Сообщить("business.module.second" + Символ(9) + ВторойБизнесОбъектПробы.СчетчикПробы());
    Сообщить("business.module.body.date.read-error" + Символ(9) + ПервыйБизнесОбъектПробы.ОшибкаЧтенияДатыПробы());
    Сообщить("business.module.body.date.assign-error" + Символ(9) + ПервыйБизнесОбъектПробы.ОшибкаПрисвоенияДатыПробы());
    Сообщить("business.module.date.after-create" + Символ(9) + Формат(ПервыйБизнесОбъектПробы.Дата, "ДФ=yyyyMMddHHmmss"));
Исключение
    Сообщить("business.module.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
