Попытка
    РусскийОбъектБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    АнглийскийОбъектБизнесПробы = BusinessProcesses.ЗамерБизнесПроцесса.CreateBusinessProcess();
    Сообщить("business.new.alias.type" + Символ(9) + ?(ТипЗнч(РусскийОбъектБизнесПробы) = ТипЗнч(АнглийскийОбъектБизнесПробы), 1, 0));
    Сообщить("business.new.distinct" + Символ(9) + ?(РусскийОбъектБизнесПробы <> АнглийскийОбъектБизнесПробы, 1, 0));
    Сообщить("business.new.date.empty" + Символ(9) + ?(РусскийОбъектБизнесПробы.Дата = Дата(1, 1, 1), 1, 0));
    Сообщить("business.new.number.string" + Символ(9) + ?(ТипЗнч(РусскийОбъектБизнесПробы.Номер) = Тип("Строка"), 1, 0));
    Сообщить("business.new.additional.structure" + Символ(9) + ?(ТипЗнч(РусскийОбъектБизнесПробы.ДополнительныеСвойства) = Тип("Структура"), 1, 0));
    РусскийОбъектБизнесПробы.ДополнительныеСвойства.Вставить("Контроль", 42);
    Сообщить("business.new.additional.isolated" + Символ(9) + АнглийскийОбъектБизнесПробы.ДополнительныеСвойства.Количество());
Исключение
    Сообщить("business.new.alias.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
