Перем ЧтениеНовойСсылкиПриСоздании, ЗаписьНовойСсылкиПриСоздании;
Функция СостояниеНовойСсылки() Экспорт Возврат ЧтениеНовойСсылкиПриСоздании + "|" + ЗаписьНовойСсылкиПриСоздании; КонецФункции
Функция СобственнаяНоваяСсылка() Экспорт Возврат ПолучитьСсылкуНового(); КонецФункции
Процедура НазначитьСобственнуюСсылку(СсылкаПробы) Экспорт SetNewObjectRef(СсылкаПробы); КонецПроцедуры
ЧтениеНовойСсылкиПриСоздании = "rejected";
Попытка ЧтениеНовойСсылкиПриСоздании = ?(ЗначениеЗаполнено(GetNewObjectRef()), "1", "0"); Исключение КонецПопытки;
ЗаписьНовойСсылкиПриСоздании = "accepted";
Попытка УстановитьСсылкуНового(БизнесПроцессы.ЗамерБизнесПроцесса.ПолучитьСсылку(Новый УникальныйИдентификатор("81ab7a18-814f-4e67-b6e7-4eb351b900d6"))); Исключение ЗаписьНовойСсылкиПриСоздании = "rejected"; КонецПопытки;
