Попытка
    ОбъектНовойСсылки = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.new-ref-module.initialization" + Символ(9) + ОбъектНовойСсылки.СостояниеНовойСсылки());
    Сообщить("business.new-ref-module.after.filled" + Символ(9) + ?(ЗначениеЗаполнено(ОбъектНовойСсылки.GetNewObjectRef()), "1", "0"));
    НазначеннаяСсылкаПробы = БизнесПроцессы.ЗамерБизнесПроцесса.ПолучитьСсылку(Новый УникальныйИдентификатор("b9a1233c-9d2a-40a0-9019-1c6336d5c6f1"));
    ОбъектНовойСсылки.НазначитьСобственнуюСсылку(НазначеннаяСсылкаПробы);
    Сообщить("business.new-ref-module.own.assigned" + Символ(9) + ?(ОбъектНовойСсылки.СобственнаяНоваяСсылка() = НазначеннаяСсылкаПробы, "1", "0"));
    Сообщить("business.new-ref-module.modified" + Символ(9) + ?(ОбъектНовойСсылки.Modified(), "1", "0"));
    ОбъектНовойСсылки.Read();
    Сообщить("business.new-ref-module.read.same" + Символ(9) + ?(ОбъектНовойСсылки.СобственнаяНоваяСсылка() = НазначеннаяСсылкаПробы, "1", "0"));
    Сообщить("business.new-ref-module.reference.empty" + Символ(9) + ?(ОбъектНовойСсылки.Ссылка.Пустая(), "1", "0"));
Исключение
    Сообщить("business.new-ref-module.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
