Попытка
    ОбъектБизнесПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    Сообщить("business.new.type" + Символ(9) + Строка(ТипЗнч(ОбъектБизнесПробы)));
    Сообщить("business.new.is-new" + Символ(9) + ?(ОбъектБизнесПробы.ЭтоНовый(), 1, 0));
    Сообщить("business.new.ref.empty" + Символ(9) + ?(ОбъектБизнесПробы.Ссылка.Пустая(), 1, 0));
    Сообщить("business.new.number" + Символ(9) + Строка(ОбъектБизнесПробы.Номер));
    Сообщить("business.new.date" + Символ(9) + Формат(ОбъектБизнесПробы.Дата, "ДФ=yyyyMMddHHmmss"));
    Сообщить("business.new.deletion-mark" + Символ(9) + ?(ОбъектБизнесПробы.ПометкаУдаления, 1, 0));
    Сообщить("business.new.started" + Символ(9) + ?(ОбъектБизнесПробы.Стартован, 1, 0));
    Сообщить("business.new.completed" + Символ(9) + ?(ОбъектБизнесПробы.Завершен, 1, 0));
    ОбъектБизнесПробы.Дата = Дата(2026, 10, 6, 12, 34, 56);
    Сообщить("business.new.date.assigned" + Символ(9) + Формат(ОбъектБизнесПробы.Дата, "ДФ=yyyyMMddHHmmss"));
    ОбъектБизнесПробы.Заполнить(Новый Структура);
    Сообщить("business.new.fill.is-new" + Символ(9) + ?(ОбъектБизнесПробы.ЭтоНовый(), 1, 0));
Исключение
    Сообщить("business.new.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
