Перем РезультатыСобственныхПолейПробы;

Функция РезультатыТелаСобственныхПолейПробы() Экспорт
    Возврат РезультатыСобственныхПолейПробы;
КонецФункции

РезультатыСобственныхПолейПробы = Новый Структура;
Попытка
    ЗначениеТекстаПробы = ТекстПробы;
    РезультатыСобственныхПолейПробы.Вставить("text_read", 0);
Исключение
    РезультатыСобственныхПолейПробы.Вставить("text_read", 1);
КонецПопытки;
Попытка
    ТекстПробы = "тело";
    РезультатыСобственныхПолейПробы.Вставить("text_assign", 0);
Исключение
    РезультатыСобственныхПолейПробы.Вставить("text_assign", 1);
КонецПопытки;
Попытка
    ЗначениеФлагаПробы = ФлагПробы;
    РезультатыСобственныхПолейПробы.Вставить("flag_read", 0);
Исключение
    РезультатыСобственныхПолейПробы.Вставить("flag_read", 1);
КонецПопытки;
Попытка
    ФлагПробы = Истина;
    РезультатыСобственныхПолейПробы.Вставить("flag_assign", 0);
Исключение
    РезультатыСобственныхПолейПробы.Вставить("flag_assign", 1);
КонецПопытки;
