Попытка
    ОбъектЧтенияЧасти = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ЧастьДоЧтения = ОбъектЧтенияЧасти.СтрокиПробы;
    СтрокаДоЧтения = ЧастьДоЧтения.Добавить();
    СтрокаДоЧтения.ТекстСтроки = "row";
    СтрокаДоЧтения.ФлагСтроки = Истина;
    ОбъектЧтенияЧасти.Прочитать();
    Сообщить("business.read-section.object.count" + Символ(9) + ОбъектЧтенияЧасти.СтрокиПробы.Количество());
    Сообщить("business.read-section.alias.count" + Символ(9) + ЧастьДоЧтения.Количество());
    РезультатСтаройСтроки = "invalid";
    Попытка РезультатСтаройСтроки = СтрокаДоЧтения.ТекстСтроки; Исключение КонецПопытки;
    Сообщить("business.read-section.old.text" + Символ(9) + РезультатСтаройСтроки);
    СтрокаПослеЧтения = ЧастьДоЧтения.Добавить();
    Сообщить("business.read-section.alias.add.object.count" + Символ(9) + ОбъектЧтенияЧасти.СтрокиПробы.Количество());
    Сообщить("business.read-section.alias.add.number" + Символ(9) + СтрокаПослеЧтения.НомерСтроки);
    СтрокаПослеЧтения.ТекстСтроки = "next";
    ОбъектЧтенияЧасти.Read();
    Сообщить("business.read-section.repeat.object.count" + Символ(9) + ОбъектЧтенияЧасти.СтрокиПробы.Количество());
    Сообщить("business.read-section.repeat.alias.count" + Символ(9) + ЧастьДоЧтения.Количество());
    СтрокаДоОчистки = ЧастьДоЧтения.Добавить();
    СтрокаДоОчистки.ТекстСтроки = "clear";
    ЧастьДоЧтения.Очистить();
    РезультатСтаройСтроки = "invalid";
    Попытка РезультатСтаройСтроки = СтрокаДоОчистки.ТекстСтроки; Исключение КонецПопытки;
    Сообщить("business.read-section.clear.old.text" + Символ(9) + РезультатСтаройСтроки);
Исключение
    Сообщить("business.read-section.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
