Попытка
    ОбъектМодуляЧтения = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    КонтейнерМодуляЧтения = ОбъектМодуляЧтения.ДополнительныеСвойства;
    КонтейнерМодуляЧтения.Вставить("ДоЧтения", "before");
    Сообщить("business.read-module.before.counter" + Символ(9) + ОбъектМодуляЧтения.Счетчик());
    ОбъектМодуляЧтения.ПрочитатьРУ();
    КонтейнерМодуляЧтения.Вставить("ПослеЧтения", "after");
    Сообщить("business.read-module.new.ru.counter" + Символ(9) + ОбъектМодуляЧтения.Счетчик());
    Сообщить("business.read-module.new.ru.extra" + Символ(9) + ОбъектМодуляЧтения.ДополнительныеСвойства.ПослеЧтения);
    ОбъектМодуляЧтения.ПрочитатьEN();
    КонтейнерМодуляЧтения.Вставить("ПослеПовтора", "again");
    Сообщить("business.read-module.new.en.counter" + Символ(9) + ОбъектМодуляЧтения.Счетчик());
    Сообщить("business.read-module.new.en.extra" + Символ(9) + ОбъектМодуляЧтения.ДополнительныеСвойства.ПослеПовтора);
Исключение
    Сообщить("business.read-module.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
