Перем РезультатыСтандартныхСвойствПробы;
Функция РезультатыПробы() Экспорт
    Возврат РезультатыСтандартныхСвойствПробы;
КонецФункции
РезультатыСтандартныхСвойствПробы = Новый Структура;
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    ЗначениеСтандартногоСвойстваПробы = Номер;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат0read", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    Номер = "контроль";
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат0assign", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    ЗначениеСтандартногоСвойстваПробы = ПометкаУдаления;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат1read", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    ПометкаУдаления = Истина;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат1assign", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    ЗначениеСтандартногоСвойстваПробы = Стартован;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат2read", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    Стартован = Истина;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат2assign", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    ЗначениеСтандартногоСвойстваПробы = Завершен;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат3read", ОшибкаСтандартногоСвойстваПробы);
ОшибкаСтандартногоСвойстваПробы = 0;
Попытка
    Завершен = Истина;
Исключение
    ОшибкаСтандартногоСвойстваПробы = 1;
КонецПопытки;
РезультатыСтандартныхСвойствПробы.Вставить("Результат3assign", ОшибкаСтандартногоСвойстваПробы);
