Попытка
    ОбъектСтандартныхСвойствПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    РезультатыСвойствПробы = ОбъектСтандартныхСвойствПробы.РезультатыПробы();
    Сообщить("business.property.body.number.read-error" + Символ(9) + РезультатыСвойствПробы.Результат0read);
    Сообщить("business.property.body.number.assign-error" + Символ(9) + РезультатыСвойствПробы.Результат0assign);
    ОшибкаСтандартногоСвойстваПробы = 0;
    Попытка
        ОбъектСтандартныхСвойствПробы.Номер = "контроль";
    Исключение
        ОшибкаСтандартногоСвойстваПробы = 1;
    КонецПопытки;
    Сообщить("business.property.after.number.assign-error" + Символ(9) + ОшибкаСтандартногоСвойстваПробы);
    Сообщить("business.property.body.deletion-mark.read-error" + Символ(9) + РезультатыСвойствПробы.Результат1read);
    Сообщить("business.property.body.deletion-mark.assign-error" + Символ(9) + РезультатыСвойствПробы.Результат1assign);
    ОшибкаСтандартногоСвойстваПробы = 0;
    Попытка
        ОбъектСтандартныхСвойствПробы.ПометкаУдаления = Истина;
    Исключение
        ОшибкаСтандартногоСвойстваПробы = 1;
    КонецПопытки;
    Сообщить("business.property.after.deletion-mark.assign-error" + Символ(9) + ОшибкаСтандартногоСвойстваПробы);
    Сообщить("business.property.body.started.read-error" + Символ(9) + РезультатыСвойствПробы.Результат2read);
    Сообщить("business.property.body.started.assign-error" + Символ(9) + РезультатыСвойствПробы.Результат2assign);
    ОшибкаСтандартногоСвойстваПробы = 0;
    Попытка
        ОбъектСтандартныхСвойствПробы.Стартован = Истина;
    Исключение
        ОшибкаСтандартногоСвойстваПробы = 1;
    КонецПопытки;
    Сообщить("business.property.after.started.assign-error" + Символ(9) + ОшибкаСтандартногоСвойстваПробы);
    Сообщить("business.property.body.completed.read-error" + Символ(9) + РезультатыСвойствПробы.Результат3read);
    Сообщить("business.property.body.completed.assign-error" + Символ(9) + РезультатыСвойствПробы.Результат3assign);
    ОшибкаСтандартногоСвойстваПробы = 0;
    Попытка
        ОбъектСтандартныхСвойствПробы.Завершен = Истина;
    Исключение
        ОшибкаСтандартногоСвойстваПробы = 1;
    КонецПопытки;
    Сообщить("business.property.after.completed.assign-error" + Символ(9) + ОшибкаСтандартногоСвойстваПробы);
Исключение
    Сообщить("business.property.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
