Попытка
    ОбъектОбработчикаЧастиПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ДругойОбъектОбработчикаЧастиПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ОбъектОбработчикаЧастиПробы.Заполнить(Новый Структура);
    Сообщить("business.section.handler.first.count" + Символ(9) + ОбъектОбработчикаЧастиПробы.СтрокиПробы.Количество());
    Сообщить("business.section.handler.first.text" + Символ(9) + ОбъектОбработчикаЧастиПробы.СтрокиПробы[0].ТекстСтроки);
    Сообщить("business.section.handler.first.flag" + Символ(9) + ?(ОбъектОбработчикаЧастиПробы.СтрокиПробы[0].ФлагСтроки, 1, 0));
    Сообщить("business.section.handler.first.calls" + Символ(9) + ОбъектОбработчикаЧастиПробы.ЧислоЗаполненийЧастиПробы());
    ОбъектОбработчикаЧастиПробы.Заполнить(Новый Структура);
    Сообщить("business.section.handler.repeat.count" + Символ(9) + ОбъектОбработчикаЧастиПробы.СтрокиПробы.Количество());
    Сообщить("business.section.handler.repeat.calls" + Символ(9) + ОбъектОбработчикаЧастиПробы.ЧислоЗаполненийЧастиПробы());
    Сообщить("business.section.handler.other.count" + Символ(9) + ДругойОбъектОбработчикаЧастиПробы.СтрокиПробы.Количество());
    Сообщить("business.section.handler.other.calls" + Символ(9) + ДругойОбъектОбработчикаЧастиПробы.ЧислоЗаполненийЧастиПробы());
Исключение
    Сообщить("business.section.handler.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
