Попытка
    ОбъектТиповСтрокПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    ЧастиТиповСтрокПробы = ОбъектТиповСтрокПробы.СтрокиПробы;
    СтрокаТиповСтрокПробы = ЧастиТиповСтрокПробы.Добавить();
    Сообщить("business.section.type.ru" + Символ(9) + ?(ТипЗнч(ЧастиТиповСтрокПробы) = Тип("БизнесПроцессТабличнаяЧасть.ЗамерБизнесПроцесса.СтрокиПробы"), 1, 0));
    Сообщить("business.section.type.en" + Символ(9) + ?(ТипЗнч(ЧастиТиповСтрокПробы) = Тип("BusinessProcessTabularSection.ЗамерБизнесПроцесса.СтрокиПробы"), 1, 0));
    Сообщить("business.section.row.type.ru" + Символ(9) + ?(ТипЗнч(СтрокаТиповСтрокПробы) = Тип("БизнесПроцессТабличнаяЧастьСтрока.ЗамерБизнесПроцесса.СтрокиПробы"), 1, 0));
    Сообщить("business.section.row.type.en" + Символ(9) + ?(ТипЗнч(СтрокаТиповСтрокПробы) = Тип("BusinessProcessTabularSectionRow.ЗамерБизнесПроцесса.СтрокиПробы"), 1, 0));
    Сообщить("business.section.type.distinct" + Символ(9) + ?(ТипЗнч(ЧастиТиповСтрокПробы) <> ТипЗнч(СтрокаТиповСтрокПробы), 1, 0));
Исключение
    Сообщить("business.section.type.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
