Перем РезультатыЧастиТелаПробы;
Функция РезультатыЧастиТела() Экспорт
    Возврат РезультатыЧастиТелаПробы;
КонецФункции
РезультатыЧастиТелаПробы = Новый Структура;
Попытка
    ЧастьТелаБизнесПробы = СтрокиПробы;
    РезультатыЧастиТелаПробы.Вставить("read", 0);
Исключение
    РезультатыЧастиТелаПробы.Вставить("read", 1);
КонецПопытки;
Попытка
    КоличествоЧастиТелаПробы = СтрокиПробы.Количество();
    РезультатыЧастиТелаПробы.Вставить("count", 0);
Исключение
    РезультатыЧастиТелаПробы.Вставить("count", 1);
КонецПопытки;
Попытка
    СтрокаЧастиТелаПробы = СтрокиПробы.Добавить();
    РезультатыЧастиТелаПробы.Вставить("add", 0);
Исключение
    РезультатыЧастиТелаПробы.Вставить("add", 1);
КонецПопытки;
Попытка
    СтрокиПробы.Очистить();
    РезультатыЧастиТелаПробы.Вставить("clear", 0);
Исключение
    РезультатыЧастиТелаПробы.Вставить("clear", 1);
КонецПопытки;
Попытка
    СтрокиПробы = Новый ТаблицаЗначений;
    РезультатыЧастиТелаПробы.Вставить("assign", 0);
Исключение
    РезультатыЧастиТелаПробы.Вставить("assign", 1);
КонецПопытки;
