Попытка
    ОбъектЗаполненияЧастиПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    СтрокаЗаполненияЧастиПробы = ОбъектЗаполненияЧастиПробы.СтрокиПробы.Добавить();
    СтрокаЗаполненияЧастиПробы.ТекстСтроки = "сохранить";
    СтрокаЗаполненияЧастиПробы.ФлагСтроки = Истина;
    ОбъектЗаполненияЧастиПробы.Заполнить(Новый Структура);
    Сообщить("business.section.fill-empty.count" + Символ(9) + ОбъектЗаполненияЧастиПробы.СтрокиПробы.Количество());
    Сообщить("business.section.fill-empty.text" + Символ(9) + ОбъектЗаполненияЧастиПробы.СтрокиПробы[0].ТекстСтроки);
    Сообщить("business.section.fill-empty.flag" + Символ(9) + ?(ОбъектЗаполненияЧастиПробы.СтрокиПробы[0].ФлагСтроки, 1, 0));
    Сообщить("business.section.fill-empty.number" + Символ(9) + СтрокаЗаполненияЧастиПробы.НомерСтроки);
    Сообщить("business.section.fill-empty.is-new" + Символ(9) + ?(ОбъектЗаполненияЧастиПробы.ЭтоНовый(), 1, 0));
Исключение
    Сообщить("business.section.fill-empty.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
