Попытка
    ОбъектЧастиТелаПробы = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
    РезультатыЧастиТелаПробы = ОбъектЧастиТелаПробы.РезультатыЧастиТела();
    Сообщить("business.section.body.read.error" + Символ(9) + РезультатыЧастиТелаПробы.read);
    Сообщить("business.section.body.count.error" + Символ(9) + РезультатыЧастиТелаПробы.count);
    Сообщить("business.section.body.add.error" + Символ(9) + РезультатыЧастиТелаПробы.add);
    Сообщить("business.section.body.clear.error" + Символ(9) + РезультатыЧастиТелаПробы.clear);
    Сообщить("business.section.body.assign.error" + Символ(9) + РезультатыЧастиТелаПробы.assign);
    Сообщить("business.section.body.after-create.count" + Символ(9) + ОбъектЧастиТелаПробы.СтрокиПробы.Количество());
    СтрокаПослеТелаПробы = ОбъектЧастиТелаПробы.СтрокиПробы.Добавить();
    Сообщить("business.section.body.after-create.add" + Символ(9) + ОбъектЧастиТелаПробы.СтрокиПробы.Количество());
Исключение
    Сообщить("business.section.body.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
