Перем ВызововЗаполненияЧастиПробы;
Функция ЧислоЗаполненийЧастиПробы() Экспорт
    Возврат ВызововЗаполненияЧастиПробы;
КонецФункции
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    ВызововЗаполненияЧастиПробы = ВызововЗаполненияЧастиПробы + 1;
    СтрокаОбработчикаЧастиПробы = СтрокиПробы.Добавить();
    СтрокаОбработчикаЧастиПробы.ТекстСтроки = "обработчик";
    СтрокаОбработчикаЧастиПробы.ФлагСтроки = Истина;
    СтандартнаяОбработка = Истина;
КонецПроцедуры
ВызововЗаполненияЧастиПробы = 0;
