ОбъектПробыАрностиЗаписи = БизнесПроцессы.ЗамерБизнесПроцесса.СоздатьБизнесПроцесс();
ОбъектПробыАрностиЗаписи.Дата = '20240102030405';
Попытка
    ОбъектПробыАрностиЗаписи.Записать(Неопределено);
    Сообщить("business.write-arity.ru" + Символ(9) + "accepted");
Исключение
    Сообщить("business.write-arity.ru" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Сообщить("business.write-arity.ru.ref.empty" + Символ(9) + ?(ОбъектПробыАрностиЗаписи.Ссылка.Пустая(), 1, 0));
Попытка
    ОбъектПробыАрностиЗаписи.Write(Неопределено);
    Сообщить("business.write-arity.en" + Символ(9) + "accepted");
Исключение
    Сообщить("business.write-arity.en" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Сообщить("business.write-arity.en.ref.empty" + Символ(9) + ?(ОбъектПробыАрностиЗаписи.Ссылка.Пустая(), 1, 0));
