Попытка
    СсылкаХарактеристикиПробы = ПланыВидовХарактеристик.ЗамерХарактеристик.Основной;
    Сообщить("characteristic.manager.predefined.type" + Символы.Таб + ?(ТипЗнч(СсылкаХарактеристикиПробы) = Тип("ПланВидовХарактеристикСсылка.ЗамерХарактеристик"), "1", "0"));
    Сообщить("characteristic.manager.predefined.context" + Символы.Таб + ?(ПланыВидовХарактеристик.ЗамерХарактеристик.ПрочитатьПредопределенный() = СсылкаХарактеристикиПробы, "1", "0"));
    Сообщить("characteristic.manager.predefined.local" + Символы.Таб + ПланыВидовХарактеристик.ЗамерХарактеристик.ПрочитатьЛокальный());
    Сообщить("characteristic.manager.predefined.global" + Символы.Таб + ?(ПредопределенноеЗначение("ПланВидовХарактеристик.ЗамерХарактеристик.Основной") = СсылкаХарактеристикиПробы, "1", "0"));
    Сообщить("characteristic.manager.predefined.global.en" + Символы.Таб + ?(ПредопределенноеЗначение("ChartOfCharacteristicTypes.ЗамерХарактеристик.Основной") = СсылкаХарактеристикиПробы, "1", "0"));
    Попытка
        ПланыВидовХарактеристик.ЗамерХарактеристик.Основной = Неопределено;
        РезультатЗаписиХарактеристикиПробы = "allowed";
    Исключение
        РезультатЗаписиХарактеристикиПробы = "read-only";
    КонецПопытки;
    Сообщить("characteristic.manager.predefined.write" + Символы.Таб + РезультатЗаписиХарактеристикиПробы);
Исключение
    Сообщить("characteristic.manager.predefined.error" + Символы.Таб + ОписаниеОшибки());
КонецПопытки;
