Перем ОтменятьГенерациюПробы, ИтогиНумерацииПробы;

Процедура НастроитьНумерацию(ОтменятьПробы) Экспорт
    ОтменятьГенерациюПробы = ОтменятьПробы;
КонецПроцедуры

Функция ПрочитатьНумерацию() Экспорт
    Возврат ИтогиНумерацииПробы;
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
    ИтогиНумерацииПробы.Добавить("standard=" + ?(СтандартнаяОбработка, "YES", "NO") + ":prefix=[" + Префикс + "]");
    Если ОтменятьГенерациюПробы Тогда
        СтандартнаяОбработка = Ложь;
        Номер = "manual";
    Иначе
        Префикс = "H-";
    КонецЕсли;
КонецПроцедуры

ОтменятьГенерациюПробы = Ложь;
ИтогиНумерацииПробы = Новый Массив;
