Перем ИтогиТелаПробы;

Функция ПрочитатьРезультатыТела() Экспорт
    Возврат ИтогиТелаПробы;
КонецФункции

ИтогиТелаПробы = Новый Массив;
Попытка
    ЗначениеТелаПробы = Номер;
    ИтогиТелаПробы.Добавить("number.read=accepted");
Исключение
    ИтогиТелаПробы.Добавить("number.read=rejected");
КонецПопытки;
Попытка
    Номер = "body";
    ИтогиТелаПробы.Добавить("number.write=accepted");
Исключение
    ИтогиТелаПробы.Добавить("number.write=rejected");
КонецПопытки;
Попытка
    ЗначениеТелаПробы = Дата;
    ИтогиТелаПробы.Добавить("date.read=accepted");
Исключение
    ИтогиТелаПробы.Добавить("date.read=rejected");
КонецПопытки;
Попытка
    Дата = Дата(2026, 1, 2);
    ИтогиТелаПробы.Добавить("date.write=accepted");
Исключение
    ИтогиТелаПробы.Добавить("date.write=rejected");
КонецПопытки;
Попытка
    ЗначениеТелаПробы = Ссылка;
    ИтогиТелаПробы.Добавить("ref.read=accepted");
Исключение
    ИтогиТелаПробы.Добавить("ref.read=rejected");
КонецПопытки;
Попытка
    ЗначениеТелаПробы = ЭтоНовый();
    ИтогиТелаПробы.Добавить("isnew=accepted");
Исключение
    ИтогиТелаПробы.Добавить("isnew=rejected");
КонецПопытки;
Попытка
    ЗначениеТелаПробы = ПометкаУдаления;
    ИтогиТелаПробы.Добавить("deletion.read=accepted");
Исключение
    ИтогиТелаПробы.Добавить("deletion.read=rejected");
КонецПопытки;
Попытка
    ЗначениеТелаПробы = Проведен;
    ИтогиТелаПробы.Добавить("posted.read=accepted");
Исключение
    ИтогиТелаПробы.Добавить("posted.read=rejected");
КонецПопытки;
