Перем ИтогиЗаполнения;
Функция ПрочитатьИтогиЗаполнения() Экспорт
    Возврат ИтогиЗаполнения;
КонецФункции
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    ИтогиЗаполнения = "[" + Заполняемый + "]:[" + НеЗаполняемый + "]";
    Заполняемый = "handler";
    НеЗаполняемый = "handler";
    Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
        ОтключитьПробы = Ложь;
        Если ДанныеЗаполнения.Свойство("Отключить", ОтключитьПробы) И ОтключитьПробы Тогда
            СтандартнаяОбработка = Ложь;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
