Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    Если ДанныеЗаполнения.Режим = "replace" Тогда
        ДанныеЗаполнения = Новый Структура("Заполняемый", "replacement");
    ИначеЕсли ДанныеЗаполнения.Режим = "mutate" Тогда
        ДанныеЗаполнения.Заполняемый = "mutation";
    ИначеЕсли ДанныеЗаполнения.Режим = "undefined" Тогда
        ДанныеЗаполнения = Неопределено;
    ИначеЕсли ДанныеЗаполнения.Режим = "empty" Тогда
        ДанныеЗаполнения = Новый Структура;
    КонецЕсли;
КонецПроцедуры
