Перем ИтогиЗаполнения;

Функция ПрочитатьИтогиЗаполнения() Экспорт
    Возврат ИтогиЗаполнения;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    ИтогиЗаполнения = Строка(ТипЗнч(ДанныеЗаполнения)) + ":" + Строка(ТипЗнч(ТекстЗаполнения)) + ":[" + Строка(ТекстЗаполнения) + "]:" + Строка(СтандартнаяОбработка);
    Номер = "handler";
    Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
        ОтключитьПробы = Ложь;
        Если ДанныеЗаполнения.Свойство("Отключить", ОтключитьПробы) И ОтключитьПробы Тогда
            СтандартнаяОбработка = Ложь;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
