// Стили линий диаграммы.

Сообщить("ROOT" + Символ(9) + Строка(ТипЛинииДиаграммы));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипЛинииДиаграммы.НетЛинии)));
Сообщить("NONE" + Символ(9) + Строка(ТипЛинииДиаграммы.НетЛинии));
Сообщить("DASHED" + Символ(9) + Строка(ТипЛинииДиаграммы.Пунктир));
Сообщить("DASH_DOT" + Символ(9) + Строка(ТипЛинииДиаграммы.ПунктирТочка));
Сообщить("DASH_DOT_DOT" + Символ(9) + Строка(ТипЛинииДиаграммы.ПунктирТочкаТочка));
Сообщить("SOLID" + Символ(9) + Строка(ТипЛинииДиаграммы.Сплошная));
Сообщить("DOTTED" + Символ(9) + Строка(ТипЛинииДиаграммы.Точечная));
Если ТипЛинииДиаграммы.НетЛинии = ChartLineType.None
    И ТипЛинииДиаграммы.Пунктир = ChartLineType.Dashed
    И ТипЛинииДиаграммы.ПунктирТочка = ChartLineType.DashDotted
    И ТипЛинииДиаграммы.ПунктирТочкаТочка = ChartLineType.DashDottedDotted
    И ТипЛинииДиаграммы.Сплошная = ChartLineType.Solid
    И ТипЛинииДиаграммы.Точечная = ChartLineType.Dotted Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
