ЗначениеПеречисленияПробы = ПредопределенноеЗначение("Перечисление.ЗамерПеречисления.Обычная");
Попытка
    РезультатПробы = Строка(Вычислить("ТипЗнч(ЗначениеПеречисленияПробы) = Тип(""ПеречислениеСсылка.ЗамерПеречисления"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.type=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ТипЗнч(ЗначениеПеречисленияПробы) = Тип(""EnumRef.ЗамерПеречисления"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.type.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Строка(ЗначениеПеречисленияПробы)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.text=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеЗаполнено(ЗначениеПеречисленияПробы)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.filled=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеПеречисленияПробы.Пустая()"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.empty=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеПеречисленияПробы.Метаданные().Имя"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.metadata=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Строка(ЗначениеПеречисленияПробы.УникальныйИдентификатор())"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.uuid=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеПеречисленияПробы = ПредопределенноеЗначение(""Перечисление.ЗамерПеречисления.Обычная"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.equal=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеПеречисленияПробы = ПредопределенноеЗначение(""Перечисление.ЗамерПеречисления.Низкая"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.different=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ПолучитьПолноеИмяПредопределенногоЗначения(ЗначениеПеречисленияПробы)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.fullname=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Обычная = ЗначениеПеречисленияПробы"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.property=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Количество()"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.count=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(1) = ЗначениеПеречисленияПробы"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(ЗначениеПеречисленияПробы)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ТипЗнч(Перечисления.ЗамерПеречисления.ПустаяСсылка()) = Тип(""ПеречислениеСсылка.ЗамерПеречисления"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.empty.type=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Строка(Перечисления.ЗамерПеречисления.ПустаяСсылка())"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.empty.text=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("ЗначениеЗаполнено(Перечисления.ЗамерПеречисления.ПустаяСсылка())"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.empty.filled=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.ПустаяСсылка().Пустая()"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.empty.empty=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.ПустаяСсылка().Метаданные().Имя"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.empty.metadata=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Строка(Метаданные.ВариантВстроенногоЯзыка)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.configuration.script=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Метаданные.ОсновнойЯзык.КодЯзыка"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.configuration.language=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Метаданные.Перечисления.ЗамерПеречисления.ЗначенияПеречисления.Обычная.Синоним"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.value.synonym=[" + РезультатПробы + "]");
