// Члены системного перечисления проверки заполнения.

Сообщить("ROOT" + Символ(9) + Строка(ПроверкаЗаполнения));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ПроверкаЗаполнения.ВыдаватьОшибку)));
Сообщить("ERROR" + Символ(9) + Строка(ПроверкаЗаполнения.ВыдаватьОшибку));
Сообщить("DONT" + Символ(9) + Строка(ПроверкаЗаполнения.НеПроверять));
Если ПроверкаЗаполнения.ВыдаватьОшибку = FillChecking.ShowError
    И ПроверкаЗаполнения.НеПроверять = FillChecking.DontCheck Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
