// Действия обработки расшифровки компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет)));
Сообщить("NONE" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет));
Сообщить("OPEN" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение));
Сообщить("FILTER" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать));
Сообщить("APPEARANCE" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить));
Сообщить("DRILL" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать));
Сообщить("GROUP" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать));
Сообщить("ORDER" + Символ(9) + Строка(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить));
Если ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет = DataCompositionDetailsProcessingAction.None
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение = DataCompositionDetailsProcessingAction.OpenValue
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать = DataCompositionDetailsProcessingAction.Filter
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить = DataCompositionDetailsProcessingAction.ApplyAppearance
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать = DataCompositionDetailsProcessingAction.DrillDown
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать = DataCompositionDetailsProcessingAction.Group
    И ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить = DataCompositionDetailsProcessingAction.Order Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
