// Способы восстановления настроек компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(СпособВосстановленияНастроекКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(СпособВосстановленияНастроекКомпоновкиДанных.Полное)));
Сообщить("FULL" + Символ(9) + Строка(СпособВосстановленияНастроекКомпоновкиДанных.Полное));
Сообщить("CHECK" + Символ(9) + Строка(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность));
Если СпособВосстановленияНастроекКомпоновкиДанных.Полное = DataCompositionSettingsRefreshMethod.Full
    И СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность = DataCompositionSettingsRefreshMethod.CheckAvailability Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
