// Режимы масштабирования просмотра документа.

Сообщить("ROOT" + Символ(9) + Строка(РежимМасштабированияПросмотра));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(РежимМасштабированияПросмотра.Авто)));
Сообщить("AUTO" + Символ(9) + Строка(РежимМасштабированияПросмотра.Авто));
Сообщить("LARGE" + Символ(9) + Строка(РежимМасштабированияПросмотра.Крупный));
Сообщить("NORMAL" + Символ(9) + Строка(РежимМасштабированияПросмотра.Обычный));
Если РежимМасштабированияПросмотра.Авто = ViewScalingMode.Auto
    И РежимМасштабированияПросмотра.Крупный = ViewScalingMode.Large
    И РежимМасштабированияПросмотра.Обычный = ViewScalingMode.Normal Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
