// Расположение итогов компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(РасположениеИтоговКомпоновкиДанных.Авто)));
Сообщить("AUTO" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных.Авто));
Сообщить("END" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных.Конец));
Сообщить("BEGIN" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных.Начало));
Сообщить("BOTH" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных.НачалоИКонец));
Сообщить("NONE" + Символ(9) + Строка(РасположениеИтоговКомпоновкиДанных.Нет));
Если РасположениеИтоговКомпоновкиДанных.Авто = DataCompositionTotalPlacement.Auto
    И РасположениеИтоговКомпоновкиДанных.Конец = DataCompositionTotalPlacement.End
    И РасположениеИтоговКомпоновкиДанных.Начало = DataCompositionTotalPlacement.Begin
    И РасположениеИтоговКомпоновкиДанных.НачалоИКонец = DataCompositionTotalPlacement.BeginAndEnd
    И РасположениеИтоговКомпоновкиДанных.Нет = DataCompositionTotalPlacement.None Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
