// Четыре члена типа файла документа PDF из синтакс-помощника.

Сообщить("PDF" + Символ(9) + Строка(ТипФайлаДокументаPDF.PDF) + Символ(9) + Строка(ТипЗнч(ТипФайлаДокументаPDF.PDF)));
Сообщить("PDF_A_1" + Символ(9) + Строка(ТипФайлаДокументаPDF.PDF_A_1) + Символ(9) + Строка(ТипЗнч(ТипФайлаДокументаPDF.PDF_A_1)));
Сообщить("PDF_A_2" + Символ(9) + Строка(ТипФайлаДокументаPDF.PDF_A_2) + Символ(9) + Строка(ТипЗнч(ТипФайлаДокументаPDF.PDF_A_2)));
Сообщить("PDF_A_3" + Символ(9) + Строка(ТипФайлаДокументаPDF.PDF_A_3) + Символ(9) + Строка(ТипЗнч(ТипФайлаДокументаPDF.PDF_A_3)));
Сообщить("PDF_ALIAS" + Символ(9) + ?(PDFDocumentFileType.PDF = ТипФайлаДокументаPDF.PDF, "Yes", "No"));
Сообщить("PDF_A_1_ALIAS" + Символ(9) + ?(PDFDocumentFileType.PDF_A_1 = ТипФайлаДокументаPDF.PDF_A_1, "Yes", "No"));
Сообщить("PDF_A_2_ALIAS" + Символ(9) + ?(PDFDocumentFileType.PDF_A_2 = ТипФайлаДокументаPDF.PDF_A_2, "Yes", "No"));
Сообщить("PDF_A_3_ALIAS" + Символ(9) + ?(PDFDocumentFileType.PDF_A_3 = ТипФайлаДокументаPDF.PDF_A_3, "Yes", "No"));
