// Все значения и написания `ИспользованиеВывода` в серверном контексте.

Если ИспользованиеВывода.Авто = UseOutput.Auto Тогда
	Сообщить("AUTO_ALIAS" + Символ(9) + "PASS");
Иначе
	Сообщить("AUTO_ALIAS" + Символ(9) + "FAIL");
КонецЕсли;
Если ИспользованиеВывода.Разрешить = UseOutput.Enable Тогда
	Сообщить("ENABLE_ALIAS" + Символ(9) + "PASS");
Иначе
	Сообщить("ENABLE_ALIAS" + Символ(9) + "FAIL");
КонецЕсли;
Если ИспользованиеВывода.Запретить = UseOutput.Disable Тогда
	Сообщить("DISABLE_ALIAS" + Символ(9) + "PASS");
Иначе
	Сообщить("DISABLE_ALIAS" + Символ(9) + "FAIL");
КонецЕсли;

Сообщить("AUTO_TEXT" + Символ(9) + Строка(ИспользованиеВывода.Авто));
Сообщить("ENABLE_TEXT" + Символ(9) + Строка(ИспользованиеВывода.Разрешить));
Сообщить("DISABLE_TEXT" + Символ(9) + Строка(ИспользованиеВывода.Запретить));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ИспользованиеВывода.Авто)));
