// Все форматы файлов табличного документа на платформе 8.3.27.
Сообщить("ANSITXT" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.ANSITXT));
Сообщить("DOCX" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.DOCX));
Сообщить("HTML" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.HTML));
Сообщить("HTML3" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.HTML3));
Сообщить("HTML4" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.HTML4));
Сообщить("HTML5" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.HTML5));
Сообщить("MXL" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.MXL));
Сообщить("MXL7" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.MXL7));
Сообщить("ODS" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.ODS));
Сообщить("PDF" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.PDF));
Сообщить("PDF_A_1" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.PDF_A_1));
Сообщить("PDF_A_2" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.PDF_A_2));
Сообщить("PDF_A_3" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.PDF_A_3));
Сообщить("TXT" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.TXT));
Сообщить("XLS" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.XLS));
Сообщить("XLS95" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.XLS95));
Сообщить("XLS97" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.XLS97));
Сообщить("XLSX" + Символ(9) + Строка(ТипФайлаТабличногоДокумента.XLSX));
Если ТипФайлаТабличногоДокумента.ANSITXT = SpreadsheetDocumentFileType.ANSITXT
    И ТипФайлаТабличногоДокумента.DOCX = SpreadsheetDocumentFileType.DOCX
    И ТипФайлаТабличногоДокумента.HTML = SpreadsheetDocumentFileType.HTML
    И ТипФайлаТабличногоДокумента.HTML3 = SpreadsheetDocumentFileType.HTML3
    И ТипФайлаТабличногоДокумента.HTML4 = SpreadsheetDocumentFileType.HTML4
    И ТипФайлаТабличногоДокумента.HTML5 = SpreadsheetDocumentFileType.HTML5
    И ТипФайлаТабличногоДокумента.MXL = SpreadsheetDocumentFileType.MXL
    И ТипФайлаТабличногоДокумента.MXL7 = SpreadsheetDocumentFileType.MXL7
    И ТипФайлаТабличногоДокумента.ODS = SpreadsheetDocumentFileType.ODS
    И ТипФайлаТабличногоДокумента.PDF = SpreadsheetDocumentFileType.PDF
    И ТипФайлаТабличногоДокумента.PDF_A_1 = SpreadsheetDocumentFileType.PDF_A_1
    И ТипФайлаТабличногоДокумента.PDF_A_2 = SpreadsheetDocumentFileType.PDF_A_2
    И ТипФайлаТабличногоДокумента.PDF_A_3 = SpreadsheetDocumentFileType.PDF_A_3
    И ТипФайлаТабличногоДокумента.TXT = SpreadsheetDocumentFileType.TXT
    И ТипФайлаТабличногоДокумента.XLS = SpreadsheetDocumentFileType.XLS
    И ТипФайлаТабличногоДокумента.XLS95 = SpreadsheetDocumentFileType.XLS95
    И ТипФайлаТабличногоДокумента.XLS97 = SpreadsheetDocumentFileType.XLS97
    И ТипФайлаТабличногоДокумента.XLSX = SpreadsheetDocumentFileType.XLSX Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
