// Нативный контроль перечисления типов периодов на платформе 8.3.27.2342.
Попытка Сообщить(Строка(Вычислить("ТипПериодаКомпоновкиДанных.Основной"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипПериодаКомпоновкиДанных.Дополнительный"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionPeriodType.Main"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionPeriodType.Additional"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипПериодаКомпоновкиДанных.Основной)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипПериодаКомпоновкиДанных)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""ТипПериодаКомпоновкиДанных"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""DataCompositionPeriodType"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипПериодаКомпоновкиДанных.Основной = DataCompositionPeriodType.Main"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипПериодаКомпоновкиДанных.Дополнительный = DataCompositionPeriodType.Additional"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипПериодаКомпоновкиДанных.Основной = ТипПериодаКомпоновкиДанных.Дополнительный"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипЗнч(ТипПериодаКомпоновкиДанных.Основной) = ТипЗнч(ТипДополненияПериодаКомпоновкиДанных.Год)"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("тИпПеРиОдАКомпоновкиДанных.оСнОвНоЙ"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
