Попытка
    МассивПробы = Новый Массив;
    Сообщить("image.native.call.order.first=" + Строка(ЗамерыТранзитивногоРодителя.Проба(МассивПробы)));
    Сообщить("image.native.call.order.first.size=" + Строка(МассивПробы.Количество()));
    Сообщить("image.native.call.order.second=" + Строка(ЗамерыТранзитивногоРодителя.Проба(МассивПробы)));
    Сообщить("image.native.call.order.second.size=" + Строка(МассивПробы.Количество()));
Исключение
    Сообщить("image.native.call.order.failure=" + ОписаниеОшибки());
КонецПопытки;
