Попытка
    ОбъектПробы = Вычислить("Документы.ЗамерДокумента.СоздатьДокумент()");
    Для Каждого ЗначениеПробы Из ОбъектПробы.ПрочитатьРезультатыТела() Цикл
        Сообщить("document.property.body." + ЗначениеПробы);
    КонецЦикла;
    Сообщить("document.property.number=" + "[" + ОбъектПробы.Номер + "]");
    Сообщить("document.property.date.empty=" + Строка(ОбъектПробы.Дата = Дата(1, 1, 1)));
    Сообщить("document.property.isnew=" + Строка(ОбъектПробы.ЭтоНовый()));
    Сообщить("document.property.ref.empty=" + Строка(ОбъектПробы.Ссылка.Пустая()));
    Сообщить("document.property.deletion=" + Строка(ОбъектПробы.ПометкаУдаления));
    Сообщить("document.property.posted=" + Строка(ОбъектПробы.Проведен));
Исключение
    Сообщить("document.property.error=" + ОписаниеОшибки());
КонецПопытки;
