// Размеры картинки по синтакс-помощнику платформы.

Сообщить("ROOT" + Символ(9) + Строка(РазмерКартинки));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(РазмерКартинки.АвтоРазмер)));
Сообщить("AUTO" + Символ(9) + Строка(РазмерКартинки.АвтоРазмер));
Сообщить("AUTO_IGNORE" + Символ(9) + Строка(РазмерКартинки.АвтоРазмерБезУчетаМасштаба));
Сообщить("FONT" + Символ(9) + Строка(РазмерКартинки.ПоРазмеруШрифта));
Сообщить("PROPORTIONAL" + Символ(9) + Строка(РазмерКартинки.Пропорционально));
Сообщить("STRETCH" + Символ(9) + Строка(РазмерКартинки.Растянуть));
Сообщить("REAL" + Символ(9) + Строка(РазмерКартинки.РеальныйРазмер));
Сообщить("REAL_IGNORE" + Символ(9) + Строка(РазмерКартинки.РеальныйРазмерБезУчетаМасштаба));
Сообщить("TILE" + Символ(9) + Строка(РазмерКартинки.Черепица));
Если РазмерКартинки.АвтоРазмер = PictureSize.AutoSize
    И РазмерКартинки.АвтоРазмерБезУчетаМасштаба = PictureSize.AutoSizeIgnoreScale
    И РазмерКартинки.ПоРазмеруШрифта = PictureSize.ByFontSize
    И РазмерКартинки.Пропорционально = PictureSize.Proportionally
    И РазмерКартинки.Растянуть = PictureSize.Stretch
    И РазмерКартинки.РеальныйРазмер = PictureSize.RealSize
    И РазмерКартинки.РеальныйРазмерБезУчетаМасштаба = PictureSize.RealSizeIgnoreScale
    И РазмерКартинки.Черепица = PictureSize.Tile Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
