// Нативный контроль использования условного оформления на платформе 8.3.27.2342.
Попытка Сообщить(Строка(Вычислить("ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionConditionalAppearanceUse.Use"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionConditionalAppearanceUse.DontUse"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ИспользованиеУсловногоОформленияКомпоновкиДанных)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""ИспользованиеУсловногоОформленияКомпоновкиДанных"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""DataCompositionConditionalAppearanceUse"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать = DataCompositionConditionalAppearanceUse.Use"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать = DataCompositionConditionalAppearanceUse.DontUse"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипЗнч(ИспользованиеУсловногоОформленияКомпоновкиДанных.Использовать) = ТипЗнч(РасположениеПоляКомпоновкиДанных.Авто)"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("иСпОлЬзОвАнИеУсловногоОформленияКомпоновкиДанных.нЕиСпОлЬзОвАтЬ"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
