// Обработка текста почтового сообщения, достигнутая в исходниках УНФ.

Процедура ПроверитьЧлен(Ключ, Значение, Псевдоним)
    Если Значение = Псевдоним Тогда
        Сообщить(Ключ + Символ(9) + Строка(Значение) + Символ(9) + "PASS");
    Иначе
        Сообщить(Ключ + Символ(9) + Строка(Значение) + Символ(9) + "FAIL");
    КонецЕсли;
КонецПроцедуры

ПроверитьЧлен("DONT", ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать, InternetMailTextProcessing.DontProcess);
ПроверитьЧлен("PROCESS", ОбработкаТекстаИнтернетПочтовогоСообщения.Обрабатывать, InternetMailTextProcessing.Process);
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ОбработкаТекстаИнтернетПочтовогоСообщения.НеОбрабатывать)));
