// Полный состав видов подписей диаграммы по синтакс-помощнику 8.3.27.

Сообщить("ROOT" + Символ(9) + Строка(ВидПодписейКДиаграмме));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ВидПодписейКДиаграмме.Нет)));
Сообщить("Value" + Символ(9) + Строка(ВидПодписейКДиаграмме.Значение));
Если ВидПодписейКДиаграмме.Значение = ChartLabelType.Value Тогда
    Сообщить("ALIAS_Value" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_Value" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("ValuePercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.ЗначениеПроцент));
Если ВидПодписейКДиаграмме.ЗначениеПроцент = ChartLabelType.ValuePercent Тогда
    Сообщить("ALIAS_ValuePercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_ValuePercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("ValueSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.ЗначениеРазмер));
Если ВидПодписейКДиаграмме.ЗначениеРазмер = ChartLabelType.ValueSize Тогда
    Сообщить("ALIAS_ValueSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_ValueSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("None" + Символ(9) + Строка(ВидПодписейКДиаграмме.Нет));
Если ВидПодписейКДиаграмме.Нет = ChartLabelType.None Тогда
    Сообщить("ALIAS_None" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_None" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("Percent" + Символ(9) + Строка(ВидПодписейКДиаграмме.Процент));
Если ВидПодписейКДиаграмме.Процент = ChartLabelType.Percent Тогда
    Сообщить("ALIAS_Percent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_Percent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("Series" + Символ(9) + Строка(ВидПодписейКДиаграмме.Серия));
Если ВидПодписейКДиаграмме.Серия = ChartLabelType.Series Тогда
    Сообщить("ALIAS_Series" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_Series" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesValue" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияЗначение));
Если ВидПодписейКДиаграмме.СерияЗначение = ChartLabelType.SeriesValue Тогда
    Сообщить("ALIAS_SeriesValue" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesValue" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesValuePercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияЗначениеПроцент));
Если ВидПодписейКДиаграмме.СерияЗначениеПроцент = ChartLabelType.SeriesValuePercent Тогда
    Сообщить("ALIAS_SeriesValuePercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesValuePercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesValueSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияЗначениеРазмер));
Если ВидПодписейКДиаграмме.СерияЗначениеРазмер = ChartLabelType.SeriesValueSize Тогда
    Сообщить("ALIAS_SeriesValueSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesValueSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияПроцент));
Если ВидПодписейКДиаграмме.СерияПроцент = ChartLabelType.SeriesPercent Тогда
    Сообщить("ALIAS_SeriesPercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияРазмер));
Если ВидПодписейКДиаграмме.СерияРазмер = ChartLabelType.SeriesSize Тогда
    Сообщить("ALIAS_SeriesSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPoint" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочка));
Если ВидПодписейКДиаграмме.СерияТочка = ChartLabelType.SeriesPoint Тогда
    Сообщить("ALIAS_SeriesPoint" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPoint" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPointValue" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочкаЗначение));
Если ВидПодписейКДиаграмме.СерияТочкаЗначение = ChartLabelType.SeriesPointValue Тогда
    Сообщить("ALIAS_SeriesPointValue" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPointValue" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPointValuePercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочкаЗначениеПроцент));
Если ВидПодписейКДиаграмме.СерияТочкаЗначениеПроцент = ChartLabelType.SeriesPointValuePercent Тогда
    Сообщить("ALIAS_SeriesPointValuePercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPointValuePercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPointValueSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочкаЗначениеРазмер));
Если ВидПодписейКДиаграмме.СерияТочкаЗначениеРазмер = ChartLabelType.SeriesPointValueSize Тогда
    Сообщить("ALIAS_SeriesPointValueSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPointValueSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPointPercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочкаПроцент));
Если ВидПодписейКДиаграмме.СерияТочкаПроцент = ChartLabelType.SeriesPointPercent Тогда
    Сообщить("ALIAS_SeriesPointPercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPointPercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("SeriesPointSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.СерияТочкаРазмер));
Если ВидПодписейКДиаграмме.СерияТочкаРазмер = ChartLabelType.SeriesPointSize Тогда
    Сообщить("ALIAS_SeriesPointSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_SeriesPointSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("Point" + Символ(9) + Строка(ВидПодписейКДиаграмме.Точка));
Если ВидПодписейКДиаграмме.Точка = ChartLabelType.Point Тогда
    Сообщить("ALIAS_Point" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_Point" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("PointValue" + Символ(9) + Строка(ВидПодписейКДиаграмме.ТочкаЗначение));
Если ВидПодписейКДиаграмме.ТочкаЗначение = ChartLabelType.PointValue Тогда
    Сообщить("ALIAS_PointValue" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_PointValue" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("PointValuePercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.ТочкаЗначениеПроцент));
Если ВидПодписейКДиаграмме.ТочкаЗначениеПроцент = ChartLabelType.PointValuePercent Тогда
    Сообщить("ALIAS_PointValuePercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_PointValuePercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("PointValueSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.ТочкаЗначениеРазмер));
Если ВидПодписейКДиаграмме.ТочкаЗначениеРазмер = ChartLabelType.PointValueSize Тогда
    Сообщить("ALIAS_PointValueSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_PointValueSize" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("PointPercent" + Символ(9) + Строка(ВидПодписейКДиаграмме.ТочкаПроцент));
Если ВидПодписейКДиаграмме.ТочкаПроцент = ChartLabelType.PointPercent Тогда
    Сообщить("ALIAS_PointPercent" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_PointPercent" + Символ(9) + "FAIL");
КонецЕсли;
Сообщить("PointSize" + Символ(9) + Строка(ВидПодписейКДиаграмме.ТочкаРазмер));
Если ВидПодписейКДиаграмме.ТочкаРазмер = ChartLabelType.PointSize Тогда
    Сообщить("ALIAS_PointSize" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_PointSize" + Символ(9) + "FAIL");
КонецЕсли;
