// Значения системного перечисления протоколов интернет-почты.

Сообщить("ROOT" + Символ(9) + Строка(ПротоколИнтернетПочты));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ПротоколИнтернетПочты.IMAP)));
Сообщить("IMAP" + Символ(9) + Строка(ПротоколИнтернетПочты.IMAP));
Сообщить("POP3" + Символ(9) + Строка(ПротоколИнтернетПочты.POP3));
Сообщить("SMTP" + Символ(9) + Строка(ПротоколИнтернетПочты.SMTP));
Если ПротоколИнтернетПочты.IMAP = InternetMailProtocol.IMAP
    И ПротоколИнтернетПочты.POP3 = InternetMailProtocol.POP3
    И ПротоколИнтернетПочты.SMTP = InternetMailProtocol.SMTP Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
