// Полный состав вариантов использования метаданных полнотекстового поиска.

Сообщить("USE" + Символ(9) + Строка(ИспользованиеМетаданныхПолнотекстовогоПоиска.Использовать) + Символ(9) + Строка(ТипЗнч(ИспользованиеМетаданныхПолнотекстовогоПоиска.Использовать)));
Сообщить("DONT" + Символ(9) + Строка(ИспользованиеМетаданныхПолнотекстовогоПоиска.НеИспользовать) + Символ(9) + Строка(ТипЗнч(ИспользованиеМетаданныхПолнотекстовогоПоиска.НеИспользовать)));
Сообщить("ALIAS" + Символ(9) + ?(FullTextSearchMetadataUse.DontUse = ИспользованиеМетаданныхПолнотекстовогоПоиска.НеИспользовать, "Yes", "No"));
