// Режим ограничения количества серий диаграммы.

Сообщить("ROOT" + Символ(9) + Строка(МаксимумСерий));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(МаксимумСерий.НеЗадано)));
Сообщить("UNDEFINED" + Символ(9) + Строка(МаксимумСерий.НеЗадано));
Сообщить("LIMITED" + Символ(9) + Строка(МаксимумСерий.Ограничено));
Сообщить("PERCENT" + Символ(9) + Строка(МаксимумСерий.Процент));
Если МаксимумСерий.НеЗадано = MaxSeries.NotDefined
    И МаксимумСерий.Ограничено = MaxSeries.Limited
    И МаксимумСерий.Процент = MaxSeries.Percent Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
