// Члены и представления варианта отображения сообщения об ошибке.

Сообщить("VALUE" + Символ(9) + Строка(ВариантОтображенияСообщенияОбОшибке.Авто) + Символ(9) + Строка(ТипЗнч(ВариантОтображенияСообщенияОбОшибке.Авто)));
Сообщить("VALUE" + Символ(9) + Строка(ВариантОтображенияСообщенияОбОшибке.СообщениеОбОшибкеДляПользователя) + Символ(9) + Строка(ТипЗнч(ВариантОтображенияСообщенияОбОшибке.СообщениеОбОшибкеДляПользователя)));
Сообщить("VALUE" + Символ(9) + Строка(ВариантОтображенияСообщенияОбОшибке.КраткоеПредставлениеОшибки) + Символ(9) + Строка(ТипЗнч(ВариантОтображенияСообщенияОбОшибке.КраткоеПредставлениеОшибки)));
Сообщить("VALUE" + Символ(9) + Строка(ВариантОтображенияСообщенияОбОшибке.ПодробноеПредставлениеОшибки) + Символ(9) + Строка(ТипЗнч(ВариантОтображенияСообщенияОбОшибке.ПодробноеПредставлениеОшибки)));
Сообщить("AUTO_ALIAS" + Символ(9) + ?(ErrorMessageDisplayVariant.Auto = ВариантОтображенияСообщенияОбОшибке.Авто, "Yes", "No"));
Сообщить("USER_ALIAS" + Символ(9) + ?(ErrorMessageDisplayVariant.ErrorMessageForUser = ВариантОтображенияСообщенияОбОшибке.СообщениеОбОшибкеДляПользователя, "Yes", "No"));
Сообщить("BRIEF_ALIAS" + Символ(9) + ?(ErrorMessageDisplayVariant.BriefErrorDescription = ВариантОтображенияСообщенияОбОшибке.КраткоеПредставлениеОшибки, "Yes", "No"));
Сообщить("DETAIL_ALIAS" + Символ(9) + ?(ErrorMessageDisplayVariant.DetailErrorDescription = ВариантОтображенияСообщенияОбОшибке.ПодробноеПредставлениеОшибки, "Yes", "No"));
