Попытка
    Сообщить("document.basis.types=" + Строка(Метаданные.ОпределяемыеТипы.ОснованиеСобытия.Тип.Типы().Количество()));
Исключение
    Сообщить("document.basis.types=rejected");
КонецПопытки;
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СписаниеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СписаниеЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СписаниеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СписаниеЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СписаниеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СписаниеЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СписаниеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СписаниеЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктОРасхождениях.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхождениях.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктОРасхождениях.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхождениях.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктОРасхождениях.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхождениях.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктОРасхождениях.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхождениях.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.КорректировкаРеализации.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.КорректировкаРеализации.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.КорректировкаРеализации.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.КорректировкаРеализации.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходнаяНакладная.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходнаяНакладная.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходнаяНакладная.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходнаяНакладная.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомиссионера.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионера.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомиссионера.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионера.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомиссионера.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионера.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомиссионера.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионера.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СверкаВзаиморасчетов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СверкаВзаиморасчетов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СверкаВзаиморасчетов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СверкаВзаиморасчетов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СверкаВзаиморасчетов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СверкаВзаиморасчетов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СверкаВзаиморасчетов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СверкаВзаиморасчетов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПеремещениеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПеремещениеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПеремещениеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПеремещениеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходныйОрдер.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходныйОрдер.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходныйОрдер.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходныйОрдер.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходнаяНакладная.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходнаяНакладная.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходнаяНакладная.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриходнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходнаяНакладная.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактураПолученный.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактураПолученный.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактураПолученный.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетФактураПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактураПолученный.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЧекККМВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМВозврат.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЧекККМВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМВозврат.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЧекККМВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМВозврат.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЧекККМВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМВозврат.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаданиеНаРаботу.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаданиеНаРаботу.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаданиеНаРаботу.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаданиеНаРаботу.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаданиеНаРаботу.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаданиеНаРаботу.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаданиеНаРаботу.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаданиеНаРаботу.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.УстановкаЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УстановкаЦенНоменклатуры.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.УстановкаЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УстановкаЦенНоменклатуры.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.УстановкаЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УстановкаЦенНоменклатуры.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.УстановкаЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УстановкаЦенНоменклатуры.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктВыполненныхРабот.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктВыполненныхРабот.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктВыполненныхРабот.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктВыполненныхРабот.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктВыполненныхРабот.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктВыполненныхРабот.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктВыполненныхРабот.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктВыполненныхРабот.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПеремещение.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПеремещение.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПеремещение.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказНаПеремещение.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПеремещение.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходСоСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходСоСчета.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходСоСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходСоСчета.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходСоСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходСоСчета.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходСоСчета.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходСоСчета.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЧекККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМ.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЧекККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМ.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЧекККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМ.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЧекККМ.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЧекККМ.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетОПереработке.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОПереработке.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетОПереработке.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОПереработке.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетОПереработке.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОПереработке.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетОПереработке.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОПереработке.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ДоговорыКонтрагентов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ДоговорыКонтрагентов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ДоговорыКонтрагентов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ДоговорыКонтрагентов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетФактура.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактура.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетФактура.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактура.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетФактура.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактура.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетФактура.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетФактура.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АвансовыйОтчет.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АвансовыйОтчет.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АвансовыйОтчет.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АвансовыйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АвансовыйОтчет.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПоступлениеВКассу.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеВКассу.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПоступлениеВКассу.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеВКассу.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПоступлениеВКассу.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеВКассу.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПоступлениеВКассу.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеВКассу.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПокупателя.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПокупателя.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПокупателя.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПокупателя.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказНаПроизводство.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПроизводство.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказНаПроизводство.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПроизводство.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказНаПроизводство.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПроизводство.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказНаПроизводство.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказНаПроизводство.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СборкаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СборкаЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СборкаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СборкаЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СборкаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СборкаЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СборкаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СборкаЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПеремещениеПоЯчейкам.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеПоЯчейкам.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПеремещениеПоЯчейкам.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеПоЯчейкам.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПеремещениеПоЯчейкам.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеПоЯчейкам.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПеремещениеПоЯчейкам.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПеремещениеПоЯчейкам.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплату.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплату.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплату.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетНаОплату.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплату.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.УчетВремени.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УчетВремени.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.УчетВремени.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УчетВремени.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.УчетВремени.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УчетВремени.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.УчетВремени.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.УчетВремени.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходыПредпринимателя.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходыПредпринимателя.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходыПредпринимателя.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходыПредпринимателя.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходыПредпринимателя.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходыПредпринимателя.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходыПредпринимателя.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходыПредпринимателя.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриемИПередачаВРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриемИПередачаВРемонт.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриемИПередачаВРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриемИПередачаВРемонт.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриемИПередачаВРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриемИПередачаВРемонт.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриемИПередачаВРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриемИПередачаВРемонт.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Событие.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Событие.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Событие.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Событие.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетОРозничныхПродажах.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОРозничныхПродажах.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетОРозничныхПродажах.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОРозничныхПродажах.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетОРозничныхПродажах.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОРозничныхПродажах.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетОРозничныхПродажах.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетОРозничныхПродажах.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктОРасхожденияхПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхожденияхПолученный.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктОРасхожденияхПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхожденияхПолученный.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.АктОРасхожденияхПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхожденияхПолученный.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.АктОРасхожденияхПолученный.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.АктОРасхожденияхПолученный.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетПереработчика.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетПереработчика.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетПереработчика.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетПереработчика.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетПереработчика.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетПереработчика.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетПереработчика.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетПереработчика.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПересортицаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПересортицаЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПересортицаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПересортицаЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПересортицаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПересортицаЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПересортицаЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПересортицаЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходДСПлан.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходДСПлан.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходДСПлан.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходДСПлан.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходДСПлан.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходДСПлан.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходДСПлан.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходДСПлан.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Доверенность.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Доверенность.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Доверенность.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Доверенность.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Доверенность.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Доверенность.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Доверенность.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Доверенность.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПлатежноеПоручение.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежноеПоручение.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПлатежноеПоручение.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежноеПоручение.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПлатежноеПоручение.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежноеПоручение.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПлатежноеПоручение.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежноеПоручение.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Справочники.ПрайсЛисты.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ПрайсЛисты.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Справочники.ПрайсЛисты.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ПрайсЛисты.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Справочники.ПрайсЛисты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ПрайсЛисты.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Справочники.ПрайсЛисты.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.CatalogRef.ПрайсЛисты.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомитенту.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомитенту.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомитенту.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомитенту.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомитенту.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомитенту.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомитенту.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомитенту.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомиссионераОСписании.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионераОСписании.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомиссионераОСписании.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионераОСписании.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОтчетКомиссионераОСписании.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионераОСписании.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОтчетКомиссионераОСписании.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОтчетКомиссионераОСписании.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Табель.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Табель.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Табель.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Табель.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Табель.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Табель.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Табель.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Табель.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходИзКассы.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходИзКассы.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходИзКассы.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходИзКассы.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.РасходИзКассы.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходИзКассы.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.РасходИзКассы.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.РасходИзКассы.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПоставщику.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПоставщику.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПоставщику.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ЗаказПоставщику.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Взаимозачет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Взаимозачет.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Взаимозачет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Взаимозачет.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.Взаимозачет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Взаимозачет.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.Взаимозачет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.Взаимозачет.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ИнвентаризацияЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ИнвентаризацияЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ИнвентаризацияЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ИнвентаризацияЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ИнвентаризацияЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ИнвентаризацияЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ИнвентаризацияЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ИнвентаризацияЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходныйОрдер.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходныйОрдер.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПриходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходныйОрдер.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПриходныйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПриходныйОрдер.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.МассоваяРассылка.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.МассоваяРассылка.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.МассоваяРассылка.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.МассоваяРассылка.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.МассоваяРассылка.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.МассоваяРассылка.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.МассоваяРассылка.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.МассоваяРассылка.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПоступлениеНаСчет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеНаСчет.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПоступлениеНаСчет.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеНаСчет.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПоступлениеНаСчет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеНаСчет.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПоступлениеНаСчет.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПоступлениеНаСчет.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СдельныйНаряд.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СдельныйНаряд.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СдельныйНаряд.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СдельныйНаряд.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СдельныйНаряд.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СдельныйНаряд.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СдельныйНаряд.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СдельныйНаряд.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплатуПоставщика.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплатуПоставщика.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплатуПоставщика.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.СчетНаОплатуПоставщика.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПереоценкаТоваровНаКомиссии.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПереоценкаТоваровНаКомиссии.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПереоценкаТоваровНаКомиссии.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПереоценкаТоваровНаКомиссии.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПереоценкаТоваровНаКомиссии.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПереоценкаТоваровНаКомиссии.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПереоценкаТоваровНаКомиссии.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПереоценкаТоваровНаКомиссии.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОперацияПоПлатежнымКартам.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОперацияПоПлатежнымКартам.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОперацияПоПлатежнымКартам.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОперацияПоПлатежнымКартам.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОперацияПоПлатежнымКартам.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОперацияПоПлатежнымКартам.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОперацияПоПлатежнымКартам.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОперацияПоПлатежнымКартам.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОприходованиеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОприходованиеЗапасов.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОприходованиеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОприходованиеЗапасов.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ОприходованиеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОприходованиеЗапасов.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ОприходованиеЗапасов.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ОприходованиеЗапасов.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПередачаТоваровМеждуОрганизациями.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПередачаТоваровМеждуОрганизациями.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПередачаТоваровМеждуОрганизациями.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПередачаТоваровМеждуОрганизациями.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПередачаТоваровМеждуОрганизациями.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПередачаТоваровМеждуОрганизациями.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПередачаТоваровМеждуОрганизациями.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПередачаТоваровМеждуОрганизациями.fill.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПлатежнаяВедомость.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежнаяВедомость.assign.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПлатежнаяВедомость.ПолучитьСсылку(Новый УникальныйИдентификатор("12345678-1234-5678-9012-123456789012"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежнаяВедомость.fill.value=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.СсылкаПробы = Документы.ПлатежнаяВедомость.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежнаяВедомость.assign.empty=" + РезультатПробы);
Попытка
    ОбъектПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ОбъектПробы.Заполнить(Новый Структура("СсылкаПробы", Документы.ПлатежнаяВедомость.ПолучитьСсылку(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))));
    ЗначениеПробы = ОбъектПробы.СсылкаПробы;
    РезультатПробы = Строка(ТипЗнч(ЗначениеПробы)) + ":[" + Строка(ЗначениеПробы.УникальныйИдентификатор()) + "]";
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("document.basis.DocumentRef.ПлатежнаяВедомость.fill.empty=" + РезультатПробы);
