// Необязательный разделитель СтрСоединить.

ЗначенияДляСоединения = Новый Массив;
ЗначенияДляСоединения.Добавить("А");
ЗначенияДляСоединения.Добавить("Б");
Сообщить("OMITTED" + Символ(9) + СтрСоединить(ЗначенияДляСоединения));
Сообщить("ALIAS" + Символ(9) + StrConcat(ЗначенияДляСоединения));
Сообщить("UNDEFINED" + Символ(9) + СтрСоединить(ЗначенияДляСоединения, Неопределено));
Сообщить("EMPTY" + Символ(9) + СтрСоединить(ЗначенияДляСоединения, ""));
Сообщить("COMMA" + Символ(9) + СтрСоединить(ЗначенияДляСоединения, ","));
