// Типы смещения табличного документа.

Сообщить("ROOT" + Символ(9) + Строка(ТипСмещенияТабличногоДокумента));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипСмещенияТабличногоДокумента.БезСмещения)));
Сообщить("NONE" + Символ(9) + Строка(ТипСмещенияТабличногоДокумента.БезСмещения));
Сообщить("VERTICAL" + Символ(9) + Строка(ТипСмещенияТабличногоДокумента.ПоВертикали));
Сообщить("HORIZONTAL" + Символ(9) + Строка(ТипСмещенияТабличногоДокумента.ПоГоризонтали));
Если ТипСмещенияТабличногоДокумента.БезСмещения = SpreadsheetDocumentShiftType.WithoutShift
    И ТипСмещенияТабличногоДокумента.ПоВертикали = SpreadsheetDocumentShiftType.Vertical
    И ТипСмещенияТабличногоДокумента.ПоГоризонтали = SpreadsheetDocumentShiftType.Horizontal Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
