// Расположение полей группировки компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(РасположениеПолейГруппировкиКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(РасположениеПолейГруппировкиКомпоновкиДанных.Вместе)));
Сообщить("TOGETHER" + Символ(9) + Строка(РасположениеПолейГруппировкиКомпоновкиДанных.Вместе));
Сообщить("SEPARATELY" + Символ(9) + Строка(РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно));
Сообщить("SEPARATELY_TOTALS" + Символ(9) + Строка(РасположениеПолейГруппировкиКомпоновкиДанных.ОтдельноИТолькоВИтогах));
Если РасположениеПолейГруппировкиКомпоновкиДанных.Вместе = DataCompositionGroupFieldsPlacement.Together
    И РасположениеПолейГруппировкиКомпоновкиДанных.Отдельно = DataCompositionGroupFieldsPlacement.Separately
    И РасположениеПолейГруппировкиКомпоновкиДанных.ОтдельноИТолькоВИтогах = DataCompositionGroupFieldsPlacement.SeparatelyAndInTotalsOnly Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
