Попытка
    АргументПробы = 0;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ЗначениеПробы(АргументПробы);
    Сообщить("image.native.method_flag2.local.promise=" + Строка(?(ТипЗнч(РезультатПробы) = Тип("Обещание"), 1, 0)));
    Сообщить("image.native.method_flag2.local.reference=" + Строка(АргументПробы));
    АргументПробы = 10;
    ЗамерыТранзитивногоРодителя.ЭкспортнаяПроцедураПробы(АргументПробы);
    Сообщить("image.native.method_flag2.export_procedure.reference=" + Строка(АргументПробы));
    АргументПробы = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ЭкспортнаяФункцияПробы(АргументПробы);
    Сообщить("image.native.method_flag2.export_function.promise=" + Строка(?(ТипЗнч(РезультатПробы) = Тип("Обещание"), 1, 0)));
    Сообщить("image.native.method_flag2.export_function.reference=" + Строка(АргументПробы));
Исключение
    Сообщить("image.native.method_flag2.failure=1");
КонецПопытки;
