// Нативный контроль типов бухгалтерских остатков на платформе 8.3.27.2342.
Попытка Сообщить(Строка(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Дебет"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Кредит"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Нет"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionAccountingBalanceType.Debit"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionAccountingBalanceType.Credit"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionAccountingBalanceType.None"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипБухгалтерскогоОстаткаКомпоновкиДанных.Дебет)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипБухгалтерскогоОстаткаКомпоновкиДанных)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""ТипБухгалтерскогоОстаткаКомпоновкиДанных"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""DataCompositionAccountingBalanceType"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Дебет = DataCompositionAccountingBalanceType.Debit"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Кредит = DataCompositionAccountingBalanceType.Credit"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Нет = DataCompositionAccountingBalanceType.None"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипБухгалтерскогоОстаткаКомпоновкиДанных.Дебет = ТипБухгалтерскогоОстаткаКомпоновкиДанных.Кредит"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипЗнч(ТипБухгалтерскогоОстаткаКомпоновкиДанных.Нет) = ТипЗнч(ТипОстаткаКомпоновкиДанных.НачальныйОстаток)"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("тИпБухгалтерскогоОстаткаКомпоновкиДанных.дЕбЕт"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
