Процедура ПрямаяПроба(ОтказПробы, СледПробы, ОписаниеПробы)
    СледПробы = 1;
    Попытка
        Если ОтказПробы Тогда
            ВызватьИсключение "проба";
        КонецЕсли;
        СледПробы = 2;
    Исключение
        ОшибкаПробы = ИнформацияОбОшибке();
        ОписаниеПробы = ОшибкаПробы.Описание;
        СледПробы = 3;
    КонецПопытки;
    СледПробы = СледПробы + 10;
КонецПроцедуры

Попытка
    СледПробы = 0;
    ОписаниеПробы = "";
    ЗамерыТранзитивногоРодителя.Проба(Ложь, СледПробы, ОписаниеПробы);
    ПрямойСледПробы = 0;
    ПрямоеОписаниеПробы = "";
    ПрямаяПроба(Ложь, ПрямойСледПробы, ПрямоеОписаниеПробы);
    Сообщить("image.native.statement_try.normal.trace=" + Строка(СледПробы));
    Сообщить("image.native.statement_try.normal.description=" + ОписаниеПробы);
    Сообщить("image.native.statement_try.normal.direct=" + Строка(?(СледПробы = ПрямойСледПробы И ОписаниеПробы = ПрямоеОписаниеПробы, 1, 0)));
Исключение
    Сообщить("image.native.statement_try.normal.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    СледПробы = 0;
    ОписаниеПробы = "";
    ЗамерыТранзитивногоРодителя.Проба(Истина, СледПробы, ОписаниеПробы);
    ПрямойСледПробы = 0;
    ПрямоеОписаниеПробы = "";
    ПрямаяПроба(Истина, ПрямойСледПробы, ПрямоеОписаниеПробы);
    Сообщить("image.native.statement_try.failure.trace=" + Строка(СледПробы));
    Сообщить("image.native.statement_try.failure.description=" + ОписаниеПробы);
    Сообщить("image.native.statement_try.failure.direct=" + Строка(?(СледПробы = ПрямойСледПробы И ОписаниеПробы = ПрямоеОписаниеПробы, 1, 0)));
Исключение
    Сообщить("image.native.statement_try.failure.failure=" + ОписаниеОшибки());
КонецПопытки;
