// Виды кнопки формы.

Сообщить("ROOT" + Символ(9) + Строка(ВидКнопкиФормы));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ВидКнопкиФормы.ОбычнаяКнопка)));
Сообщить("HYPERLINK" + Символ(9) + Строка(ВидКнопкиФормы.Гиперссылка));
Сообщить("COMMAND_HYPERLINK" + Символ(9) + Строка(ВидКнопкиФормы.ГиперссылкаКоманднойПанели));
Сообщить("COMMAND_BUTTON" + Символ(9) + Строка(ВидКнопкиФормы.КнопкаКоманднойПанели));
Сообщить("USUAL" + Символ(9) + Строка(ВидКнопкиФормы.ОбычнаяКнопка));
Если ВидКнопкиФормы.Гиперссылка = FormButtonType.Hyperlink
    И ВидКнопкиФормы.ГиперссылкаКоманднойПанели = FormButtonType.CommandBarHyperlink
    И ВидКнопкиФормы.КнопкаКоманднойПанели = FormButtonType.CommandBarButton
    И ВидКнопкиФормы.ОбычнаяКнопка = FormButtonType.UsualButton Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
