// Нативный контроль типов остатков на платформе 8.3.27.2342.
Попытка Сообщить(Строка(Вычислить("ТипОстаткаКомпоновкиДанных.НачальныйОстаток"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипОстаткаКомпоновкиДанных.КонечныйОстаток"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипОстаткаКомпоновкиДанных.Нет"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionBalanceType.OpeningBalance"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionBalanceType.ClosingBalance"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("DataCompositionBalanceType.None"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипОстаткаКомпоновкиДанных.НачальныйОстаток)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("ТипЗнч(ТипОстаткаКомпоновкиДанных)"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""ТипОстаткаКомпоновкиДанных"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("Тип(""DataCompositionBalanceType"")"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипОстаткаКомпоновкиДанных.НачальныйОстаток = DataCompositionBalanceType.OpeningBalance"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипОстаткаКомпоновкиДанных.КонечныйОстаток = DataCompositionBalanceType.ClosingBalance"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипОстаткаКомпоновкиДанных.Нет = DataCompositionBalanceType.None"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипОстаткаКомпоновкиДанных.НачальныйОстаток = ТипОстаткаКомпоновкиДанных.КонечныйОстаток"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(?(Вычислить("ТипЗнч(ТипОстаткаКомпоновкиДанных.Нет) = ТипЗнч(ТипПериодаКомпоновкиДанных.Основной)"), "1", "0")); Исключение Сообщить("ОШИБКА"); КонецПопытки;
Попытка Сообщить(Строка(Вычислить("тИпОстаткаКомпоновкиДанных.нАчАлЬнЫйОсТаТоК"))); Исключение Сообщить("ОШИБКА"); КонецПопытки;
