// Члены и английские имена автоматического сохранения данных формы.

Сообщить("USE" + Символ(9) + Строка(АвтоматическоеСохранениеДанныхФормыВНастройках.Использовать) + Символ(9) + Строка(ТипЗнч(АвтоматическоеСохранениеДанныхФормыВНастройках.Использовать)));
Сообщить("DONT_USE" + Символ(9) + Строка(АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать) + Символ(9) + Строка(ТипЗнч(АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать)));
Сообщить("USE_ALIAS" + Символ(9) + ?(AutoSaveFormDataInSettings.Use = АвтоматическоеСохранениеДанныхФормыВНастройках.Использовать, "Yes", "No"));
Сообщить("DONT_USE_ALIAS" + Символ(9) + ?(AutoSaveFormDataInSettings.DontUse = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать, "Yes", "No"));
