Попытка
    ПервыйАргументФлагаПробы = 5;
    ВторойАргументФлагаПробы = 6;
    ТретийАргументФлагаПробы = 7;
    РезультатФлагаПробы = ЗамерыТранзитивногоРодителя.Проба(ПервыйАргументФлагаПробы, ВторойАргументФлагаПробы, ТретийАргументФлагаПробы);
    Сообщить("image.private-procedure-three.result=" + Строка(РезультатФлагаПробы));
    Сообщить("image.private-procedure-three.first=" + Строка(ПервыйАргументФлагаПробы));
    Сообщить("image.private-procedure-three.second=" + Строка(ВторойАргументФлагаПробы));
    Сообщить("image.private-procedure-three.third=" + Строка(ТретийАргументФлагаПробы));
Исключение
    Сообщить("image.private-procedure-three.error=" + ОписаниеОшибки());
КонецПопытки;
