// Начало и конец квартала на границе года и диапазона дат.

Сообщить("Q1_BEGIN" + Символ(9) + Формат(НачалоКвартала(Дата(2024, 2, 29, 12, 34, 56)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q1_END" + Символ(9) + Формат(КонецКвартала(Дата(2024, 2, 29, 12, 34, 56)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q2_BEGIN" + Символ(9) + Формат(НачалоКвартала(Дата(2024, 4, 1)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q2_END" + Символ(9) + Формат(КонецКвартала(Дата(2024, 6, 30)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q3_BEGIN" + Символ(9) + Формат(НачалоКвартала(Дата(2024, 9, 30)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q3_END" + Символ(9) + Формат(КонецКвартала(Дата(2024, 7, 1)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q4_BEGIN" + Символ(9) + Формат(НачалоКвартала(Дата(2024, 12, 31)), "ДФ=yyyyMMddHHmmss"));
Сообщить("Q4_END" + Символ(9) + Формат(КонецКвартала(Дата(2024, 10, 1)), "ДФ=yyyyMMddHHmmss"));
Сообщить("MAX_BEGIN" + Символ(9) + Формат(НачалоКвартала(Дата(9999, 12, 31)), "ДФ=yyyyMMddHHmmss"));
Сообщить("MAX_END" + Символ(9) + Формат(КонецКвартала(Дата(9999, 12, 31)), "ДФ=yyyyMMddHHmmss"));
