Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(-1)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.negative=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(3)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.limit=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(1.5)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.fraction=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(""1"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.string=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(Неопределено)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.undefined=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Получить(Истина)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.boolean=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(Перечисления.ЗамерПеречисления.ПустаяСсылка())"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.empty=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(Неопределено)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.undefined=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(Null)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.null=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(""Обычная"")"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.string=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Индекс(ОтправкаЭлементаДанных.Авто)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.foreign=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Enums.ЗамерПеречисления.Get(1) = Перечисления.ЗамерПеречисления.Обычная"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Enums.ЗамерПеречисления.Count()"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.count.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Enums.ЗамерПеречисления.IndexOf(Перечисления.ЗамерПеречисления.Обычная)"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.index.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Enums.ЗамерПеречисления.EmptyRef().IsEmpty()"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.empty.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("Перечисления.ЗамерПеречисления.Обычная.Metadata().Имя"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.metadata.alias=[" + РезультатПробы + "]");
Попытка
    РезультатПробы = Строка(Вычислить("перечисления.замерперечисления.получить(1) = Перечисления.ЗамерПеречисления.ОБЫЧНАЯ"));
Исключение
    РезультатПробы = "rejected";
КонецПопытки;
Сообщить("configuration.enum.manager.get.case=[" + РезультатПробы + "]");
