// Члены и английские имена режима использования параметра команды.

Сообщить("SINGLE" + Символ(9) + Строка(РежимИспользованияПараметраКоманды.Одиночный) + Символ(9) + Строка(ТипЗнч(РежимИспользованияПараметраКоманды.Одиночный)));
Сообщить("MULTIPLE" + Символ(9) + Строка(РежимИспользованияПараметраКоманды.Множественный) + Символ(9) + Строка(ТипЗнч(РежимИспользованияПараметраКоманды.Множественный)));
Сообщить("SINGLE_ALIAS" + Символ(9) + ?(CommandParameterUseMode.Single = РежимИспользованияПараметраКоманды.Одиночный, "Yes", "No"));
Сообщить("MULTIPLE_ALIAS" + Символ(9) + ?(CommandParameterUseMode.Multiple = РежимИспользованияПараметраКоманды.Множественный, "Yes", "No"));
