Попытка
    МассивПробы = Новый Массив;
    Сообщить("image.native.method.write.first=" + Строка(ЗамерыТранзитивногоРодителя.Проба(МассивПробы)));
    Сообщить("image.native.method.write.value=" + Строка(МассивПробы[0]));
    МассивПробы.Добавить(10);
    Сообщить("image.native.method.write.second=" + Строка(ЗамерыТранзитивногоРодителя.Проба(МассивПробы)));
    Сообщить("image.native.method.write.last=" + Строка(МассивПробы[2]));
Исключение
    Сообщить("image.native.method.write.failure=" + ОписаниеОшибки());
КонецПопытки;
