Попытка
    ОбъектПробы = Вычислить("Документы.ЗамерДокумента.СоздатьДокумент()");
    Для Каждого ИтогПробы Из ОбъектПробы.ПрочитатьРезультатыТела() Цикл
        Сообщить("document.context.body." + ИтогПробы);
    КонецЦикла;
    Сообщить("document.context.loading=" + Строка(ОбъектПробы.dAtAeXcHaNgE.lOaD));
    Сообщить("document.context.autofill=" + Строка(ОбъектПробы.DataExchange.Recipients.AutoFill));
    Сообщить("document.context.additional=" + Строка(ОбъектПробы.aDdItIoNaLpRoPeRtIeS.body));
    ОбъектПробы.DataExchange.Load = Истина;
    ОбъектПробы.DataExchange.Recipients.AutoFill = Ложь;
    ОбъектПробы.AdditionalProperties.Вставить("body", 23);
    ДругойОбъектПробы = Вычислить("Документы.ЗамерДокумента.СоздатьДокумент()");
    Сообщить("document.context.first=" + Строка(ОбъектПробы.ОбменДанными.Загрузка) + ":" + Строка(ОбъектПробы.ОбменДанными.Получатели.АвтоЗаполнение) + ":" + Строка(ОбъектПробы.ДополнительныеСвойства.body));
    Сообщить("document.context.second=" + Строка(ДругойОбъектПробы.ОбменДанными.Загрузка) + ":" + Строка(ДругойОбъектПробы.ОбменДанными.Получатели.АвтоЗаполнение) + ":" + Строка(ДругойОбъектПробы.ДополнительныеСвойства.body));
Исключение
    Сообщить("document.context.error=" + ОписаниеОшибки());
КонецПопытки;
