// Нативная проба пропусков в локальном вызове с восемью параметрами.
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ФункцияПервый(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ФункцияПервый.result=" + Формат(РезультатПробы, "ЧГ=0"));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ФункцияПервый.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ФункцияПервый.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ФункцияСредний(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ФункцияСредний.result=" + Формат(РезультатПробы, "ЧГ=0"));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ФункцияСредний.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ФункцияСредний.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ФункцияПоследний(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ФункцияПоследний.result=" + Формат(РезультатПробы, "ЧГ=0"));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ФункцияПоследний.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ФункцияПоследний.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ФункцияВсе(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ФункцияВсе.result=" + Формат(РезультатПробы, "ЧГ=0"));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ФункцияВсе.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ФункцияВсе.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    РезультатПробы = ЗамерыТранзитивногоРодителя.ФункцияЯвноНеопределено(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    БылОтказПробы = 0;
Исключение
    БылОтказПробы = 1;
КонецПопытки;
Сообщить("image.native.local_omitted.ФункцияЯвноНеопределено.error=" + Строка(БылОтказПробы));
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    ЗамерыТранзитивногоРодителя.ПроцедураПервый(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ПроцедураПервый.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ПроцедураПервый.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    ЗамерыТранзитивногоРодителя.ПроцедураСредний(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ПроцедураСредний.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ПроцедураСредний.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    ЗамерыТранзитивногоРодителя.ПроцедураПоследний(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ПроцедураПоследний.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ПроцедураПоследний.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    ЗамерыТранзитивногоРодителя.ПроцедураВсе(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg0=" + Строка(АргументПробы0));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg1=" + Строка(АргументПробы1));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg2=" + Строка(АргументПробы2));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg3=" + Строка(АргументПробы3));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg4=" + Строка(АргументПробы4));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg5=" + Строка(АргументПробы5));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg6=" + Строка(АргументПробы6));
    Сообщить("image.native.local_omitted.ПроцедураВсе.arg7=" + Строка(АргументПробы7));
Исключение
    Сообщить("image.native.local_omitted.ПроцедураВсе.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы0 = 3;
    АргументПробы1 = 4;
    АргументПробы2 = 5;
    АргументПробы3 = 6;
    АргументПробы4 = 7;
    АргументПробы5 = 8;
    АргументПробы6 = 9;
    АргументПробы7 = 10;
    ЗамерыТранзитивногоРодителя.ПроцедураЯвноНеопределено(АргументПробы0, АргументПробы1, АргументПробы2, АргументПробы3, АргументПробы4, АргументПробы5, АргументПробы6, АргументПробы7);
    БылОтказПробы = 0;
Исключение
    БылОтказПробы = 1;
КонецПопытки;
Сообщить("image.native.local_omitted.ПроцедураЯвноНеопределено.error=" + Строка(БылОтказПробы));
