// Все значения системного перечисления типа области ячеек.

Сообщить("ROOT" + Символ(9) + Строка(ТипОбластиЯчеекТабличногоДокумента));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипОбластиЯчеекТабличногоДокумента.Таблица)));
Сообщить("TABLE" + Символ(9) + Строка(ТипОбластиЯчеекТабличногоДокумента.Таблица));
Сообщить("ROWS" + Символ(9) + Строка(ТипОбластиЯчеекТабличногоДокумента.Строки));
Сообщить("COLUMNS" + Символ(9) + Строка(ТипОбластиЯчеекТабличногоДокумента.Колонки));
Сообщить("RECTANGLE" + Символ(9) + Строка(ТипОбластиЯчеекТабличногоДокумента.Прямоугольник));
Если ТипОбластиЯчеекТабличногоДокумента.Таблица = SpreadsheetDocumentCellAreaType.Table Тогда
    Сообщить("ALIAS_TABLE" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS_TABLE" + Символ(9) + "FAIL");
КонецЕсли;
