// Полный состав типов файла пакета отображаемых документов.

Сообщить("DOCX" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.DOCX) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.DOCX)));
Сообщить("HTML4" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.HTML4) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.HTML4)));
Сообщить("HTML5" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.HTML5) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.HTML5)));
Сообщить("ODS" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.ODS) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.ODS)));
Сообщить("PDF" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.PDF) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.PDF)));
Сообщить("TXT" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.TXT) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.TXT)));
Сообщить("XLS" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.XLS) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.XLS)));
Сообщить("XLSX" + Символ(9) + Строка(ТипФайлаПакетаОтображаемыхДокументов.XLSX) + Символ(9) + Строка(ТипЗнч(ТипФайлаПакетаОтображаемыхДокументов.XLSX)));
Сообщить("ALIAS" + Символ(9) + ?(RepresentableDocumentBatchFileType.PDF = ТипФайлаПакетаОтображаемыхДокументов.PDF, "Yes", "No"));
