Попытка
    ОбъектНумерацииПробы = Вычислить("Документы.ЗамерДокумента.СоздатьДокумент()");
    ОбъектНумерацииПробы.НастроитьНумерацию(Истина);
    ОбъектНумерацииПробы.УстановитьНовыйНомер("P-");
    Сообщить("document.number.handler.cancel=[" + ОбъектНумерацииПробы.Номер + "]");
    ОбъектНумерацииПробы.НастроитьНумерацию(Ложь);
    ОбъектНумерацииПробы.SetNewNumber();
    Сообщить("document.number.handler.generate=[" + ОбъектНумерацииПробы.Номер + "]");
    Для Каждого СтрокаНумерацииПробы Из ОбъектНумерацииПробы.ПрочитатьНумерацию() Цикл
        Сообщить("document.number.handler.call=" + СтрокаНумерацииПробы);
    КонецЦикла;
Исключение
    Сообщить("document.number.handler.error=" + ОписаниеОшибки());
КонецПопытки;
