// Режим перетаскивания файла, достигнутый в исходниках УНФ.

Если СпособПеретаскиванияФайлов.КакСсылкаНаФайл = FileDragMode.AsFileRef Тогда
    Сообщить("REF" + Символ(9) + Строка(СпособПеретаскиванияФайлов.КакСсылкаНаФайл) + Символ(9) + "PASS");
Иначе
    Сообщить("REF" + Символ(9) + "FAIL");
КонецЕсли;

Если СпособПеретаскиванияФайлов.КакФайл = FileDragMode.AsFile Тогда
    Сообщить("FILE" + Символ(9) + Строка(СпособПеретаскиванияФайлов.КакФайл) + Символ(9) + "PASS");
Иначе
    Сообщить("FILE" + Символ(9) + "FAIL");
КонецЕсли;

Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(СпособПеретаскиванияФайлов.КакСсылкаНаФайл)));
