// Расположение реквизитов компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(РасположениеРеквизитовКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(РасположениеРеквизитовКомпоновкиДанных.Вместе)));
Сообщить("TOGETHER" + Символ(9) + Строка(РасположениеРеквизитовКомпоновкиДанных.Вместе));
Сообщить("WITH_OWNER" + Символ(9) + Строка(РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем));
Сообщить("SPECIAL" + Символ(9) + Строка(РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции));
Сообщить("SEPARATELY" + Символ(9) + Строка(РасположениеРеквизитовКомпоновкиДанных.Отдельно));
Если РасположениеРеквизитовКомпоновкиДанных.Вместе = DataCompositionAttributesPlacement.Together
    И РасположениеРеквизитовКомпоновкиДанных.ВместеСВладельцем = DataCompositionAttributesPlacement.WithOwnerField
    И РасположениеРеквизитовКомпоновкиДанных.ВСпециальнойПозиции = DataCompositionAttributesPlacement.SpecialPosition
    И РасположениеРеквизитовКомпоновкиДанных.Отдельно = DataCompositionAttributesPlacement.Separately Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
