// Типы группировки компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(ТипГруппировкиКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипГруппировкиКомпоновкиДанных.Иерархия)));
Сообщить("HIERARCHY" + Символ(9) + Строка(ТипГруппировкиКомпоновкиДанных.Иерархия));
Сообщить("HIERARCHY_ONLY" + Символ(9) + Строка(ТипГруппировкиКомпоновкиДанных.ТолькоИерархия));
Сообщить("ITEMS" + Символ(9) + Строка(ТипГруппировкиКомпоновкиДанных.Элементы));
Если ТипГруппировкиКомпоновкиДанных.Иерархия = DataCompositionGroupType.Hierarchy
    И ТипГруппировкиКомпоновкиДанных.ТолькоИерархия = DataCompositionGroupType.HierarchyOnly
    И ТипГруппировкиКомпоновкиДанных.Элементы = DataCompositionGroupType.Items Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
