Попытка
    МенеджерПробы = Вычислить("Справочники.ЗамерВременныхТаблиц");
    ИтогиПробы = МенеджерПробы.ПроверитьСсылки();
    Сообщить("manager.reference.0=" + Строка(ИтогиПробы[0]));
    Сообщить("manager.reference.1=" + Строка(ИтогиПробы[1]));
    Сообщить("manager.reference.2=" + Строка(ИтогиПробы[2]));
    Сообщить("manager.reference.3=" + Строка(ИтогиПробы[3]));
    Сообщить("manager.reference.4=" + Строка(ИтогиПробы[4]));
    Сообщить("manager.reference.5=" + Строка(ИтогиПробы[5]));
    Сообщить("manager.reference.6=" + Строка(ИтогиПробы[6]));
    Сообщить("manager.reference.7=" + Строка(ИтогиПробы[7]));
    Сообщить("manager.reference.8=" + Строка(ИтогиПробы[8]));
    Сообщить("manager.reference.9=" + Строка(ИтогиПробы[9]));
    Сообщить("manager.reference.10=" + Строка(ИтогиПробы[10]));
    Сообщить("manager.reference.11=" + Строка(ИтогиПробы[11]));
    Сообщить("manager.reference.12=" + Строка(ИтогиПробы[12]));
    Сообщить("manager.reference.13=" + Строка(ИтогиПробы[13]));
Исключение
    Сообщить("manager.reference.error=" + ОписаниеОшибки());
КонецПопытки;
