// Полный состав способов кодирования вложения почты.

Сообщить("MIME" + Символ(9) + Строка(СпособКодированияИнтернетПочтовогоВложения.MIME) + Символ(9) + Строка(ТипЗнч(СпособКодированияИнтернетПочтовогоВложения.MIME)));
Сообщить("UU" + Символ(9) + Строка(СпособКодированияИнтернетПочтовогоВложения.UUEncode) + Символ(9) + Строка(ТипЗнч(СпособКодированияИнтернетПочтовогоВложения.UUEncode)));
Сообщить("ALIAS" + Символ(9) + ?(InternetMailAttachmentEncodingMode.MIME = СпособКодированияИнтернетПочтовогоВложения.MIME, "Yes", "No"));
