// Отображение группы кнопок, достигнутое в исходниках УНФ.

Если ОтображениеГруппыКнопок.Авто = ButtonGroupRepresentation.Auto Тогда
    Сообщить("AUTO" + Символ(9) + Строка(ОтображениеГруппыКнопок.Авто) + Символ(9) + "PASS");
Иначе
    Сообщить("AUTO" + Символ(9) + "FAIL");
КонецЕсли;

Если ОтображениеГруппыКнопок.Обычное = ButtonGroupRepresentation.Usual Тогда
    Сообщить("USUAL" + Символ(9) + Строка(ОтображениеГруппыКнопок.Обычное) + Символ(9) + "PASS");
Иначе
    Сообщить("USUAL" + Символ(9) + "FAIL");
КонецЕсли;

Если ОтображениеГруппыКнопок.Компактное = ButtonGroupRepresentation.Compact Тогда
    Сообщить("COMPACT" + Символ(9) + Строка(ОтображениеГруппыКнопок.Компактное) + Символ(9) + "PASS");
Иначе
    Сообщить("COMPACT" + Символ(9) + "FAIL");
КонецЕсли;

Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ОтображениеГруппыКнопок.Компактное)));
