// Полный состав способа поиска строки при вводе по строке.

Сообщить("BEGIN" + Символ(9) + Строка(СпособПоискаСтрокиПриВводеПоСтроке.Начало)
    + Символ(9) + Строка(ТипЗнч(СпособПоискаСтрокиПриВводеПоСтроке.Начало)));
Сообщить("ANY_PART" + Символ(9) + Строка(СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть)
    + Символ(9) + Строка(ТипЗнч(СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть)));
Сообщить("BEGIN_ALIAS" + Символ(9) + ?(SearchStringModeOnInputByString.Begin
    = СпособПоискаСтрокиПриВводеПоСтроке.Начало, "Yes", "No"));
Сообщить("ANY_PART_ALIAS" + Символ(9) + ?(SearchStringModeOnInputByString.AnyPart
    = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть, "Yes", "No"));
