// Направления сортировки компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(НаправлениеСортировкиКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(НаправлениеСортировкиКомпоновкиДанных.Возр)));
Сообщить("ASC" + Символ(9) + Строка(НаправлениеСортировкиКомпоновкиДанных.Возр));
Сообщить("DESC" + Символ(9) + Строка(НаправлениеСортировкиКомпоновкиДанных.Убыв));
Если НаправлениеСортировкиКомпоновкиДанных.Возр = DataCompositionSortDirection.Asc
    И НаправлениеСортировкиКомпоновкиДанных.Убыв = DataCompositionSortDirection.Desc Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
