// Полный состав статусов транзакции записи журнала регистрации.

Сообщить("COMMITTED" + Символ(9) + Строка(СтатусТранзакцииЗаписиЖурналаРегистрации.Зафиксирована) + Символ(9) + Строка(ТипЗнч(СтатусТранзакцииЗаписиЖурналаРегистрации.Зафиксирована)));
Сообщить("UNFINISHED" + Символ(9) + Строка(СтатусТранзакцииЗаписиЖурналаРегистрации.НеЗавершена) + Символ(9) + Строка(ТипЗнч(СтатусТранзакцииЗаписиЖурналаРегистрации.НеЗавершена)));
Сообщить("NONE" + Символ(9) + Строка(СтатусТранзакцииЗаписиЖурналаРегистрации.НетТранзакции) + Символ(9) + Строка(ТипЗнч(СтатусТранзакцииЗаписиЖурналаРегистрации.НетТранзакции)));
Сообщить("ROLLED" + Символ(9) + Строка(СтатусТранзакцииЗаписиЖурналаРегистрации.Отменена) + Символ(9) + Строка(ТипЗнч(СтатусТранзакцииЗаписиЖурналаРегистрации.Отменена)));
Сообщить("ALIAS" + Символ(9) + ?(EventLogEntryTransactionStatus.Committed = СтатусТранзакцииЗаписиЖурналаРегистрации.Зафиксирована, "Yes", "No"));
