// Преобразование достигнутого в УНФ буфера в шестнадцатеричную строку.

Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ПолучитьДвоичныеДанныеИзBase64Строки("AKv/"));
Сообщить("BYTES" + Символ(9) + ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер));
Если ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер) = GetHexStringFromBinaryDataBuffer(Буфер) Тогда
    Сообщить("ALIAS" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS" + Символ(9) + "FAIL");
КонецЕсли;
Попытка
    ПолучитьHexСтрокуИзБуфераДвоичныхДанных("не буфер");
    Сообщить("TYPE" + Символ(9) + "NO_ERROR");
Исключение
    Сообщить("TYPE" + Символ(9) + "ERROR");
КонецПопытки;
