Попытка
    ОбъектПробы = Справочники.ЗамерВременныхТаблиц.СоздатьЭлемент();
    ОбъектПробы.Наименование = "filled";
    ОбъектПробы.ПроверяемаяСтрока = "filled";
    ИтогПробы = ОбъектПробы.ПроверитьЗаполнение();
    Сообщить("catalog.scalars.empty=" + ?(ИтогПробы, "TRUE", "FALSE"));
    Сообщить("catalog.scalars.input=" + ОбъектПробы.ПрочитатьНаблюдение());
    СообщенияПробы = ПолучитьСообщенияПользователю(Истина);
    Для Каждого СообщениеПробы Из СообщенияПробы Цикл
        Сообщить("catalog.scalars.empty.field=" + СообщениеПробы.Поле);
    КонецЦикла;
    ОбъектПробы.ПроверяемоеЧисло = 1;
    ОбъектПробы.ПроверяемаяДата = Дата(2026, 10, 2);
    ИтогПробы = ОбъектПробы.ПроверитьЗаполнение();
    Сообщить("catalog.scalars.false=" + ?(ИтогПробы, "TRUE", "FALSE"));
    ОбъектПробы.ПроверяемоеБулево = Истина;
    ИтогПробы = ОбъектПробы.ПроверитьЗаполнение();
    Сообщить("catalog.scalars.true=" + ?(ИтогПробы, "TRUE", "FALSE"));
Исключение
    Сообщить("catalog.scalars.error=" + ОписаниеОшибки());
КонецПопытки;
