// Полный состав видов шрифта.

Сообщить("WINDOWS" + Символ(9) + Строка(ВидШрифта.WindowsШрифт) + Символ(9) + Строка(ТипЗнч(ВидШрифта.WindowsШрифт)));
Сообщить("ABSOLUTE" + Символ(9) + Строка(ВидШрифта.Абсолютный) + Символ(9) + Строка(ТипЗнч(ВидШрифта.Абсолютный)));
Сообщить("AUTO" + Символ(9) + Строка(ВидШрифта.АвтоШрифт) + Символ(9) + Строка(ТипЗнч(ВидШрифта.АвтоШрифт)));
Сообщить("STYLE" + Символ(9) + Строка(ВидШрифта.ЭлементСтиля) + Символ(9) + Строка(ТипЗнч(ВидШрифта.ЭлементСтиля)));
Сообщить("ALIAS" + Символ(9) + ?(FontType.Absolute = ВидШрифта.Абсолютный, "Yes", "No"));
