// Закрытые перечисления оформления элементов формы, достигнутые при запуске УНФ.

Сообщить("ItemVerticalAlign.ROOT" + Символ(9) + Строка(ВертикальноеПоложениеЭлемента));
Сообщить("ItemVerticalAlign.TYPE" + Символ(9) + Строка(ТипЗнч(ВертикальноеПоложениеЭлемента.Авто)));
Сообщить("ItemVerticalAlign.Auto" + Символ(9) + Строка(ВертикальноеПоложениеЭлемента.Авто));
Сообщить("ItemVerticalAlign.Top" + Символ(9) + Строка(ВертикальноеПоложениеЭлемента.Верх));
Сообщить("ItemVerticalAlign.Bottom" + Символ(9) + Строка(ВертикальноеПоложениеЭлемента.Низ));
Сообщить("ItemVerticalAlign.Center" + Символ(9) + Строка(ВертикальноеПоложениеЭлемента.Центр));
Если ВертикальноеПоложениеЭлемента.Авто = ItemVerticalAlign.Auto
    И ВертикальноеПоложениеЭлемента.Верх = ItemVerticalAlign.Top
    И ВертикальноеПоложениеЭлемента.Низ = ItemVerticalAlign.Bottom
    И ВертикальноеПоложениеЭлемента.Центр = ItemVerticalAlign.Center Тогда
    Сообщить("ItemVerticalAlign.ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ItemVerticalAlign.ALIASES" + Символ(9) + "FAIL");
КонецЕсли;

Сообщить("FormItemSpacing.ROOT" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы));
Сообщить("FormItemSpacing.TYPE" + Символ(9) + Строка(ТипЗнч(ИнтервалМеждуЭлементамиФормы.Авто)));
Сообщить("FormItemSpacing.Auto" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Авто));
Сообщить("FormItemSpacing.Double" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Двойной));
Сообщить("FormItemSpacing.None" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Нет));
Сообщить("FormItemSpacing.Single" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Одинарный));
Сообщить("FormItemSpacing.Half" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Половинный));
Сообщить("FormItemSpacing.OneAndHalf" + Символ(9) + Строка(ИнтервалМеждуЭлементамиФормы.Полуторный));
Если ИнтервалМеждуЭлементамиФормы.Авто = FormItemSpacing.Auto
    И ИнтервалМеждуЭлементамиФормы.Двойной = FormItemSpacing.Double
    И ИнтервалМеждуЭлементамиФормы.Нет = FormItemSpacing.None
    И ИнтервалМеждуЭлементамиФормы.Одинарный = FormItemSpacing.Single
    И ИнтервалМеждуЭлементамиФормы.Половинный = FormItemSpacing.Half
    И ИнтервалМеждуЭлементамиФормы.Полуторный = FormItemSpacing.OneAndHalf Тогда
    Сообщить("FormItemSpacing.ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("FormItemSpacing.ALIASES" + Символ(9) + "FAIL");
КонецЕсли;

