// Все значения системного перечисления выбора групп и элементов.

Сообщить("ROOT" + Символ(9) + Строка(ГруппыИЭлементы));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ГруппыИЭлементы.Авто)));
Сообщить("AUTO" + Символ(9) + Строка(ГруппыИЭлементы.Авто));
Сообщить("FOLDERS" + Символ(9) + Строка(ГруппыИЭлементы.Группы));
Сообщить("BOTH" + Символ(9) + Строка(ГруппыИЭлементы.ГруппыИЭлементы));
Сообщить("ITEMS" + Символ(9) + Строка(ГруппыИЭлементы.Элементы));
Если ГруппыИЭлементы.Авто = FoldersAndItems.Auto
    И ГруппыИЭлементы.Группы = FoldersAndItems.Folders
    И ГруппыИЭлементы.ГруппыИЭлементы = FoldersAndItems.FoldersAndItems
    И ГруппыИЭлементы.Элементы = FoldersAndItems.Items Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
