// Полный состав перечисления рисунков, достигнутого при компиляции UNF.

Сообщить("GEOGRAPHICAL_SCHEMA" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.ГеографическаяСхема));
Сообщить("GROUP" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Группа));
Сообщить("DENDROGRAM" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Дендрограмма));
Сообщить("CHART" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Диаграмма));
Сообщить("GANTT_CHART" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.ДиаграммаГанта));
Сообщить("PICTURE" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Картинка));
Сообщить("OBJECT" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Объект));
Сообщить("COMMENT" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Примечание));
Сообщить("LINE" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Прямая));
Сообщить("RECTANGLE" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Прямоугольник));
Сообщить("PIVOT_CHART" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.СводнаяДиаграмма));
Сообщить("TEXT" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Текст));
Сообщить("ELLIPSE" + Символ(9) + Строка(ТипРисункаТабличногоДокумента.Эллипс));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипРисункаТабличногоДокумента.Картинка)));
Сообщить("RECTANGLE_TYPE" + Символ(9) + Строка(ТипЗнч(ТипРисункаТабличногоДокумента.Прямоугольник)));
Если ТипРисункаТабличногоДокумента.Картинка = SpreadsheetDocumentDrawingType.Picture Тогда
    Сообщить("ALIAS" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIAS" + Символ(9) + "FAIL");
КонецЕсли;
