Попытка
    АргументПробы = "абв xyz";
    ПриемникПробы = Неопределено;
    ПрямойАргументПробы = "абв xyz";
    ОжиданиеПробы = Прав(ПрямойАргументПробы, 3);
    РезультатПробы = ЗамерыТранзитивногоРодителя.ПравПробы(АргументПробы, ПриемникПробы);
    Если 58 = 107 Тогда
        ТекстРезультатаПробы = Строка(?(РезультатПробы = Тип("Дата"), 1, 0));
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Булево") Тогда
        ТекстРезультатаПробы = Строка(?(РезультатПробы, 1, 0));
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Дата") Тогда
        ТекстРезультатаПробы = Формат(РезультатПробы, "ДФ=yyyyMMddHHmmss");
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Число") Тогда
        ТекстРезультатаПробы = Формат(РезультатПробы, "ЧГ=0;ЧРД=.");
    Иначе
        ТекстРезультатаПробы = Строка(РезультатПробы);
    КонецЕсли;
    Если ТипЗнч(АргументПробы) = Тип("Дата") Тогда
        ТекстАргументаПробы = Формат(АргументПробы, "ДФ=yyyyMMddHHmmss");
    Иначе
        ТекстАргументаПробы = Строка(АргументПробы);
    КонецЕсли;
    Сообщить("image.native.builtin_snapshot.58.value=" + ТекстРезультатаПробы);
    Сообщить("image.native.builtin_snapshot.58.argument=" + ТекстАргументаПробы);
    Сообщить("image.native.builtin_snapshot.58.direct=" + Строка(?(РезультатПробы = ОжиданиеПробы И ПриемникПробы = ОжиданиеПробы, 1, 0)));
Исключение
    Сообщить("image.native.builtin_snapshot.58.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
    АргументПробы = "  ";
    ПриемникПробы = Неопределено;
    ПрямойАргументПробы = "  ";
    ОжиданиеПробы = ПустаяСтрока(ПрямойАргументПробы);
    РезультатПробы = ЗамерыТранзитивногоРодителя.ПустоПробы(АргументПробы, ПриемникПробы);
    Если 65 = 107 Тогда
        ТекстРезультатаПробы = Строка(?(РезультатПробы = Тип("Дата"), 1, 0));
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Булево") Тогда
        ТекстРезультатаПробы = Строка(?(РезультатПробы, 1, 0));
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Дата") Тогда
        ТекстРезультатаПробы = Формат(РезультатПробы, "ДФ=yyyyMMddHHmmss");
    ИначеЕсли ТипЗнч(РезультатПробы) = Тип("Число") Тогда
        ТекстРезультатаПробы = Формат(РезультатПробы, "ЧГ=0;ЧРД=.");
    Иначе
        ТекстРезультатаПробы = Строка(РезультатПробы);
    КонецЕсли;
    Если ТипЗнч(АргументПробы) = Тип("Дата") Тогда
        ТекстАргументаПробы = Формат(АргументПробы, "ДФ=yyyyMMddHHmmss");
    Иначе
        ТекстАргументаПробы = Строка(АргументПробы);
    КонецЕсли;
    Сообщить("image.native.builtin_snapshot.65.value=" + ТекстРезультатаПробы);
    Сообщить("image.native.builtin_snapshot.65.argument=" + ТекстАргументаПробы);
    Сообщить("image.native.builtin_snapshot.65.direct=" + Строка(?(РезультатПробы = ОжиданиеПробы И ПриемникПробы = ОжиданиеПробы, 1, 0)));
Исключение
    Сообщить("image.native.builtin_snapshot.65.failure=" + ОписаниеОшибки());
КонецПопытки;
