// Типы вывода текста компоновки данных.

Сообщить("ROOT" + Символ(9) + Строка(ТипВыводаТекстаКомпоновкиДанных));
Сообщить("TYPE" + Символ(9) + Строка(ТипЗнч(ТипВыводаТекстаКомпоновкиДанных.Авто)));
Сообщить("AUTO" + Символ(9) + Строка(ТипВыводаТекстаКомпоновкиДанных.Авто));
Сообщить("OUTPUT" + Символ(9) + Строка(ТипВыводаТекстаКомпоновкиДанных.Выводить));
Сообщить("DONT" + Символ(9) + Строка(ТипВыводаТекстаКомпоновкиДанных.НеВыводить));
Если ТипВыводаТекстаКомпоновкиДанных.Авто = DataCompositionTextOutputType.Auto
    И ТипВыводаТекстаКомпоновкиДанных.Выводить = DataCompositionTextOutputType.Output
    И ТипВыводаТекстаКомпоновкиДанных.НеВыводить = DataCompositionTextOutputType.DontOutput Тогда
    Сообщить("ALIASES" + Символ(9) + "PASS");
Иначе
    Сообщить("ALIASES" + Символ(9) + "FAIL");
КонецЕсли;
