Функция ПробаВозвратаИзПопытки(ВызватьОшибку, СледПробы) Экспорт
    Попытка
        СледПробы = СледПробы + "Т";
        Если ВызватьОшибку Тогда
            ВызватьИсключение "контроль";
        КонецЕсли;
        Возврат 11;
    Исключение
        СледПробы = СледПробы + "И";
        Возврат 22;
    КонецПопытки;
    СледПробы = СледПробы + "Х";
    Возврат 33;
КонецФункции

Функция ПробаПродолженияПослеПопытки(ВызватьОшибку, СледПробы) Экспорт
    Попытка
        СледПробы = СледПробы + "Т";
        Если ВызватьОшибку Тогда
            ВызватьИсключение "контроль";
        КонецЕсли;
    Исключение
        СледПробы = СледПробы + "И";
    КонецПопытки;
    СледПробы = СледПробы + "Х";
    Возврат 33;
КонецФункции

