Функция Исправный() Экспорт
    Возврат 42;
КонецФункции

Функция НеизвестныйМетод() Экспорт
    Сообщить("module.unknown_common.body=CALLED");
    Возврат ЗамерыТранзитивногоДочернего.НетТакогоМетодаПробы(АргументПробы());
КонецФункции

Функция АргументПробы()
    Сообщить("module.unknown_common.argument=CALLED");
    Возврат 17;
КонецФункции

Процедура НеизвестныйМетодПроцедуры() Экспорт
    Сообщить("module.unknown_common.procedure_body=CALLED");
    ЗамерыТранзитивногоДочернего.НетТакогоМетодаПробы();
КонецПроцедуры
