Попытка
    ДокументДетейHTMLПробы = Новый ДокументHTML;
    Для Каждого УзелДетейHTMLПробы Из ДокументДетейHTMLПробы.ДочерниеУзлы Цикл
        Сообщить("html.child.name" + Символ(9) + УзелДетейHTMLПробы.ИмяУзла);
        Сообщить("html.child.type" + Символ(9) + Строка(ТипЗнч(УзелДетейHTMLПробы)));
        Сообщить("html.child.kind" + Символ(9) + Строка(УзелДетейHTMLПробы.ТипУзла));
        Сообщить("html.child.parent" + Символ(9) + Строка(УзелДетейHTMLПробы.РодительскийУзел = ДокументДетейHTMLПробы));
    КонецЦикла;
Исключение
    Сообщить("html.children.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
