Попытка
    ДокументПустогоЗаголовкаHTMLПробы = Новый ДокументHTML("");
    Сообщить("html.empty.title.children" + Символ(9) + Строка(ДокументПустогоЗаголовкаHTMLПробы.ЭлементДокумента.ДочерниеУзлы.Количество()));
    ПисательПустогоЗаголовкаHTMLПробы = Новый ЗаписьHTML;
    ПисательПустогоЗаголовкаHTMLПробы.УстановитьСтроку();
    ПисательДереваПустогоЗаголовкаHTMLПробы = Новый ЗаписьDOM;
    ПисательДереваПустогоЗаголовкаHTMLПробы.Записать(ДокументПустогоЗаголовкаHTMLПробы, ПисательПустогоЗаголовкаHTMLПробы);
    Сообщить("html.empty.title.output" + Символ(9) + ПисательПустогоЗаголовкаHTMLПробы.Закрыть());
Исключение
    Сообщить("html.empty.title.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
