Попытка
    ДокументТиповHTMLПробы = Новый ДокументHTML;
    Сообщить("html.type.document" + Символ(9) + Строка(ТипЗнч(ДокументТиповHTMLПробы) = Тип("HTMLDocument")));
    Сообщить("html.type.body" + Символ(9) + Строка(ТипЗнч(ДокументТиповHTMLПробы.СоздатьЭлемент("body")) = Тип("HTMLBodyElement")));
    ИменаУзловHTMLПробы = Новый Массив;
    ИменаУзловHTMLПробы.Добавить("html");
    ИменаУзловHTMLПробы.Добавить("head");
    ИменаУзловHTMLПробы.Добавить("title");
    ИменаУзловHTMLПробы.Добавить("div");
    ИменаУзловHTMLПробы.Добавить("br");
    Для Каждого ИмяУзлаHTMLПробы Из ИменаУзловHTMLПробы Цикл
        УзелТиповHTMLПробы = ДокументТиповHTMLПробы.СоздатьЭлемент(ИмяУзлаHTMLПробы);
        Сообщить("html.type." + ИмяУзлаHTMLПробы + Символ(9) + Строка(ТипЗнч(УзелТиповHTMLПробы)));
    КонецЦикла;
Исключение
    Сообщить("html.type.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
