Попытка
    ДокументСтруктурыHTMLПробы = Новый ДокументHTML;
    Сообщить("html.initial.root" + Символ(9) + ДокументСтруктурыHTMLПробы.ЭлементДокумента.ИмяУзла);
    Сообщить("html.initial.root.children" + Символ(9) + Строка(ДокументСтруктурыHTMLПробы.ЭлементДокумента.ДочерниеУзлы.Количество()));
    Сообщить("html.initial.body.undefined" + Символ(9) + Строка(ДокументСтруктурыHTMLПробы.Тело = Неопределено));
    НовоеТелоСтруктурыHTMLПробы = ДокументСтруктурыHTMLПробы.СоздатьЭлемент("body");
    ДокументСтруктурыHTMLПробы.Тело = НовоеТелоСтруктурыHTMLПробы;
    Сообщить("html.body.same" + Символ(9) + Строка(ДокументСтруктурыHTMLПробы.Тело = НовоеТелоСтруктурыHTMLПробы));
    Сообщить("html.body.type" + Символ(9) + Строка(ТипЗнч(НовоеТелоСтруктурыHTMLПробы)));
    Сообщить("html.body.name" + Символ(9) + НовоеТелоСтруктурыHTMLПробы.ИмяУзла);
    ДругоеТелоСтруктурыHTMLПробы = ДокументСтруктурыHTMLПробы.СоздатьЭлемент("body");
    ДокументСтруктурыHTMLПробы.Тело = ДругоеТелоСтруктурыHTMLПробы;
    Сообщить("html.body.replaced" + Символ(9) + Строка(ДокументСтруктурыHTMLПробы.Тело = ДругоеТелоСтруктурыHTMLПробы));
    Сообщить("html.body.old.parent.undefined" + Символ(9) + Строка(НовоеТелоСтруктурыHTMLПробы.РодительскийУзел = Неопределено));
Исключение
    Сообщить("html.structure.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Попытка
    ДокументТекстаHTMLПробы = Новый ДокументHTML("Заголовок <&>");
    НовоеТелоТекстаHTMLПробы = ДокументТекстаHTMLПробы.СоздатьЭлемент("body");
    ДокументТекстаHTMLПробы.Тело = НовоеТелоТекстаHTMLПробы;
    НовоеТелоТекстаHTMLПробы.ДобавитьДочерний(ДокументТекстаHTMLПробы.СоздатьТекстовыйУзел("<&>"""));
    НовоеТелоТекстаHTMLПробы.ДобавитьДочерний(ДокументТекстаHTMLПробы.СоздатьЭлемент("br"));
    НовоеТелоТекстаHTMLПробы.ДобавитьДочерний(ДокументТекстаHTMLПробы.СоздатьЭлемент("div"));
    ПисательСтруктурыHTMLПробы = Новый ЗаписьHTML;
    ПисательСтруктурыHTMLПробы.УстановитьСтроку();
    ПисательДереваHTMLПробы = Новый ЗаписьDOM;
    ПисательДереваHTMLПробы.Записать(ДокументТекстаHTMLПробы, ПисательСтруктурыHTMLПробы);
    Сообщить("html.title.empty.text" + Символ(9) + ПисательСтруктурыHTMLПробы.Закрыть());
Исключение
    Сообщить("html.title.empty.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
