Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница76(АргументПробы);
Сообщить("image.native.calendar.76.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.76.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.76.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница77(АргументПробы);
Сообщить("image.native.calendar.77.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.77.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.77.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница78(АргументПробы);
Сообщить("image.native.calendar.78.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.78.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.78.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница79(АргументПробы);
Сообщить("image.native.calendar.79.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.79.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.79.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница80(АргументПробы);
Сообщить("image.native.calendar.80.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.80.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.80.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница81(АргументПробы);
Сообщить("image.native.calendar.81.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.81.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.81.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница93(АргументПробы);
Сообщить("image.native.calendar.93.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.93.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.93.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница94(АргументПробы);
Сообщить("image.native.calendar.94.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.94.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.94.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница95(АргументПробы);
Сообщить("image.native.calendar.95.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.95.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.95.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница96(АргументПробы);
Сообщить("image.native.calendar.96.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.96.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.96.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница97(АргументПробы);
Сообщить("image.native.calendar.97.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.97.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.97.failure=" + ОписаниеОшибки());
КонецПопытки;
Попытка
АргументПробы = Дата(2024, 2, 3, 4, 5, 6);
РезультатПробы = ЗамерыТранзитивногоРодителя.Граница98(АргументПробы);
Сообщить("image.native.calendar.98.result=" + Строка(?(РезультатПробы, 1, 0)));
Сообщить("image.native.calendar.98.reference=" + Формат(АргументПробы, "ДФ=yyyyMMddHHmmss"));
Исключение
Сообщить("image.native.calendar.98.failure=" + ОписаниеОшибки());
КонецПопытки;
