Для Каждого ИмяPOP3Пробы Из СтрРазделить("APOP,CramMD5,Обычная,General", ",") Цикл
    Попытка
        ЗначениеPOP3Пробы = Вычислить("СпособPOP3Аутентификации." + ИмяPOP3Пробы);
        ЗначениеPOP3АнглПробы = Вычислить("POP3AuthenticationMode." + ИмяPOP3Пробы);
        Сообщить("mail.pop3." + ИмяPOP3Пробы + Символ(9) + Строка(ЗначениеPOP3Пробы) + Символ(9) + ?(ЗначениеPOP3Пробы = ЗначениеPOP3АнглПробы, "1", "0"));
    Исключение
        Сообщить("mail.pop3.error." + ИмяPOP3Пробы + Символ(9) + ОписаниеОшибки());
    КонецПопытки;
КонецЦикла;
Попытка
    Сообщить("mail.pop3.root" + Символ(9) + Строка(Вычислить("СпособPOP3Аутентификации")));
    Сообщить("mail.pop3.type" + Символ(9) + Строка(ТипЗнч(Вычислить("СпособPOP3Аутентификации.Обычная"))));
Исключение
    Сообщить("mail.pop3.root.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
Для Каждого ИмяSMTPПробы Из СтрРазделить("CramMD5,Login,Plain,БезАутентификации,None,ПоУмолчанию,Default", ",") Цикл
    Попытка
        ЗначениеSMTPПробы = Вычислить("СпособSMTPАутентификации." + ИмяSMTPПробы);
        ЗначениеSMTPАнглПробы = Вычислить("SMTPAuthenticationMode." + ИмяSMTPПробы);
        Сообщить("mail.smtp." + ИмяSMTPПробы + Символ(9) + Строка(ЗначениеSMTPПробы) + Символ(9) + ?(ЗначениеSMTPПробы = ЗначениеSMTPАнглПробы, "1", "0"));
    Исключение
        Сообщить("mail.smtp.error." + ИмяSMTPПробы + Символ(9) + ОписаниеОшибки());
    КонецПопытки;
КонецЦикла;
Попытка
    Сообщить("mail.smtp.root" + Символ(9) + Строка(Вычислить("СпособSMTPАутентификации")));
    Сообщить("mail.smtp.type" + Символ(9) + Строка(ТипЗнч(Вычислить("СпособSMTPАутентификации.Login"))));
    Сообщить("mail.pop3.type.alias" + Символ(9) + ?(Тип("СпособPOP3Аутентификации") = Тип("POP3AuthenticationMode"), "1", "0"));
    Сообщить("mail.smtp.type.alias" + Символ(9) + ?(Тип("СпособSMTPАутентификации") = Тип("SMTPAuthenticationMode"), "1", "0"));
Исключение
    Сообщить("mail.smtp.root.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
