ТочкаПробы = БизнесПроцессы.ЗамерБизнесПроцесса.ТочкиМаршрута.Действие1;
Попытка
    Сообщить("route.points.type.russian" + Символ(9) + Строка(ТипЗнч(ТочкаПробы) = Тип("ТочкаМаршрутаБизнесПроцессаСсылка.ЗамерБизнесПроцесса")));
Исключение
    Сообщить("route.points.type.russian" + Символ(9) + "error");
КонецПопытки;
Попытка
    Сообщить("route.points.type.english" + Символ(9) + Строка(ТипЗнч(ТочкаПробы) = Тип("BusinessProcessRoutePointRef.ЗамерБизнесПроцесса")));
Исключение
    Сообщить("route.points.type.english" + Символ(9) + "error");
КонецПопытки;
