Попытка
    Сообщить("task.presentation.type=" + Строка(ТипЗнч(Задачи.ЗамерЗадачи.ПустаяСсылка())));
    Сообщить("task.presentation.primary=" + Метаданные.DefaultLanguage.LanguageCode);
    Сообщить("task.presentation.alias=" + Строка(?(Тип("TaskRef.ЗамерЗадачи") = ТипЗнч(Задачи.ЗамерЗадачи.ПустаяСсылка()), 1, 0)));
Исключение
    Сообщить("task.presentation.error=" + ОписаниеОшибки());
КонецПопытки;
ПризнакЗапретаЯзыка = 0;
Попытка
    Выполнить("Метаданные.DefaultLanguage = Метаданные.DefaultLanguage");
Исключение
    ПризнакЗапретаЯзыка = 1;
КонецПопытки;
Сообщить("task.presentation.readonly=" + Строка(ПризнакЗапретаЯзыка));
