Попытка
    ПолучитьСообщенияПользователю(Истина);
    ОбъектПроверкиПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    Сообщить("document.check.messages-ru.empty" + Символ(9) + ?(ОбъектПроверкиПробы.ПроверитьЗаполнение(), "1", "0"));
    Для Каждого СообщениеПроверкиПробы Из ПолучитьСообщенияПользователю(Истина) Цикл
        Сообщить("document.check.messages-ru.empty.item" + Символ(9) + СообщениеПроверкиПробы.Поле + "|" + СообщениеПроверкиПробы.Текст);
    КонецЦикла;
    ОбъектПроверкиПробы.Дата = Дата(2026, 10, 11);
    ОбъектПроверкиПробы.Номер = "probe";
    ОбъектПроверкиПробы.Запасы.Добавить();
    Сообщить("document.check.messages-ru.row" + Символ(9) + ?(ОбъектПроверкиПробы.ПроверитьЗаполнение(), "1", "0"));
    Для Каждого СообщениеПроверкиПробы Из ПолучитьСообщенияПользователю(Истина) Цикл
        Сообщить("document.check.messages-ru.row.item" + Символ(9) + СообщениеПроверкиПробы.Поле + "|" + СообщениеПроверкиПробы.Текст);
    КонецЦикла;
Исключение
    Сообщить("document.check.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
