ОписаниеПеременнойПробы = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12, ДопустимаяДлина.Переменная));
ОписаниеФиксированнойПробы = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12, ДопустимаяДлина.Фиксированная));
Сообщить("variable.encoding" + Символ(9) + ЗначениеВСтрокуВнутр(ОписаниеПеременнойПробы));
Сообщить("fixed.encoding" + Символ(9) + ЗначениеВСтрокуВнутр(ОписаниеФиксированнойПробы));
Сообщить("variable.short" + Символ(9) + "[" + ОписаниеПеременнойПробы.ПривестиЗначение("ab") + "]");
Сообщить("fixed.short" + Символ(9) + "[" + ОписаниеФиксированнойПробы.ПривестиЗначение("ab") + "]");
