Попытка
    ИсходникКопированияПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ИсходникКопированияПробы.Заполняемый = "source";
    ИсходникКопированияПробы.Дата = Дата(2020, 1, 2);
    ИсходникКопированияПробы.ЗначениеМодуляПробы = 8;
    КопияДокументаПробы = ИсходникКопированияПробы.Скопировать();
    Сообщить("document.copy.handler.trace" + Символ(9) + КопияДокументаПробы.СледКопированияПробы);
    Сообщить("document.copy.handler.attribute" + Символ(9) + КопияДокументаПробы.Заполняемый);
    Сообщить("document.copy.handler.source" + Символ(9) + ИсходникКопированияПробы.Заполняемый);
Исключение
    Сообщить("document.copy.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
