Попытка
    ИсходникКопированияПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    ИсходникКопированияПробы.Дата = Дата(2020, 1, 2);
    МоментНачалаПробы = ТекущаяДата();
    КопияДокументаПробы = ИсходникКопированияПробы.Скопировать();
    МоментОкончанияПробы = ТекущаяДата();
    Сообщить("document.copy.date.filled" + Символ(9) + ?(ЗначениеЗаполнено(КопияДокументаПробы.Дата), "1", "0"));
    Сообщить("document.copy.date.empty" + Символ(9) + ?(КопияДокументаПробы.Дата = Дата(1, 1, 1), "1", "0"));
    Сообщить("document.copy.date.current.interval" + Символ(9) + ?(КопияДокументаПробы.Дата >= МоментНачалаПробы И КопияДокументаПробы.Дата <= МоментОкончанияПробы, "1", "0"));
Исключение
    Сообщить("document.copy.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
