Попытка
    ИсходникКопированияПробы = Документы.ЗамерДокумента.СоздатьДокумент();
    СтрокаКопированияПробы = ИсходникКопированияПробы.Запасы.Добавить();
    СтрокаКопированияПробы.НомерВариантаКП = 7;
    КопияДокументаПробы = ИсходникКопированияПробы.Скопировать();
    Сообщить("document.copy.table.count" + Символ(9) + Строка(КопияДокументаПробы.Запасы.Количество()));
    Сообщить("document.copy.table.value" + Символ(9) + Строка(КопияДокументаПробы.Запасы[0].НомерВариантаКП));
    КопияДокументаПробы.Запасы[0].НомерВариантаКП = 9;
    Сообщить("document.copy.table.source" + Символ(9) + Строка(ИсходникКопированияПробы.Запасы[0].НомерВариантаКП));
    КопияДокументаПробы.Запасы.Очистить();
    Сообщить("document.copy.table.source.count" + Символ(9) + Строка(ИсходникКопированияПробы.Запасы.Количество()));
Исключение
    Сообщить("document.copy.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
