Попытка
    СхемаДляПоискаПробы = Новый ГрафическаяСхема;
    ЭлементыПоискаПробы = СхемаДляПоискаПробы.ЭлементыГрафическойСхемы;
    РезультатПоискаПробы = "accepted";
    ЗначениеПоискаПробы = "unchanged";
    Попытка ЗначениеПоискаПробы = ЭлементыПоискаПробы.Найти(); Исключение РезультатПоискаПробы = "rejected"; ОшибкаПоискаПробы = ОписаниеОшибки(); КонецПопытки;
    Сообщить("graphical.find.omitted" + Символ(9) + РезультатПоискаПробы);
    Сообщить("graphical.find.omitted.error" + Символ(9) + СтрЗаменить(ОшибкаПоискаПробы, Символы.ПС, " | "));
    Сообщить("graphical.find.omitted.undefined" + Символ(9) + ?(ЗначениеПоискаПробы = Неопределено, "1", "0"));
    РезультатПоискаПробы = "accepted";
    ЗначениеПоискаПробы = "unchanged";
    Попытка ЗначениеПоискаПробы = ЭлементыПоискаПробы.Find(Неопределено); Исключение РезультатПоискаПробы = "rejected"; ОшибкаПоискаПробы = ОписаниеОшибки(); КонецПопытки;
    Сообщить("graphical.find.undefined" + Символ(9) + РезультатПоискаПробы);
    Сообщить("graphical.find.undefined.error" + Символ(9) + СтрЗаменить(ОшибкаПоискаПробы, Символы.ПС, " | "));
    Сообщить("graphical.find.undefined.result" + Символ(9) + ?(ЗначениеПоискаПробы = Неопределено, "1", "0"));
    РезультатПоискаПробы = "accepted";
    ЗначениеПоискаПробы = "unchanged";
    Попытка ЗначениеПоискаПробы = ЭлементыПоискаПробы.Find(1); Исключение РезультатПоискаПробы = "rejected"; ОшибкаПоискаПробы = ОписаниеОшибки(); КонецПопытки;
    Сообщить("graphical.find.number" + Символ(9) + РезультатПоискаПробы);
    Сообщить("graphical.find.number.error" + Символ(9) + СтрЗаменить(ОшибкаПоискаПробы, Символы.ПС, " | "));
    Сообщить("graphical.find.number.unchanged" + Символ(9) + ?(ЗначениеПоискаПробы = "unchanged", "1", "0"));
Исключение
    Сообщить("graphical.find.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
