Попытка
    ТекстПроцедурыПробы = "initial";
    РезультатПроцедурыПробы = ЗамерыЛенивойАрности.ИзменитьТекст(ТекстПроцедурыПробы);
    Сообщить("imported.procedure.expression.type" + Символ(9) + Строка(ТипЗнч(РезультатПроцедурыПробы)));
    Сообщить("imported.procedure.expression.parameter" + Символ(9) + ТекстПроцедурыПробы);
Исключение
    Сообщить("imported.procedure.expression.error" + Символ(9) + ОписаниеОшибки());
    Сообщить("imported.procedure.expression.parameter" + Символ(9) + ТекстПроцедурыПробы);
КонецПопытки;
