ОшибкаОдногоЧисла2ФАПробы = 0;
Попытка
    ЗначениеАрности2ФАПробы = Вычислить("Новый SecondAuthenticationFactorSetting(1)");
Исключение
    ОшибкаОдногоЧисла2ФАПробы = 1;
КонецПопытки;
Сообщить("twofactor.arity.number.error" + Символ(9) + Строка(ОшибкаОдногоЧисла2ФАПробы));
ОшибкаОднойСтроки2ФАПробы = 0;
Попытка
    ЗначениеАрности2ФАПробы = Вычислить("Новый НастройкаВторогоФактораАутентификации(""контроль"")");
Исключение
    ОшибкаОднойСтроки2ФАПробы = 1;
КонецПопытки;
Сообщить("twofactor.arity.string.error" + Символ(9) + Строка(ОшибкаОднойСтроки2ФАПробы));
ОшибкаДвухЧисел2ФАПробы = 0;
Попытка
    ЗначениеАрности2ФАПробы = Вычислить("Новый SecondAuthenticationFactorSetting(1, 2)");
Исключение
    ОшибкаДвухЧисел2ФАПробы = 1;
КонецПопытки;
Сообщить("twofactor.arity.two.error" + Символ(9) + Строка(ОшибкаДвухЧисел2ФАПробы));
