// Клиентское создание временного потока: арность, стадия ошибки и повторное ожидание.
Асинх Функция ПробаВременногоАсинх(ИдВременногоАсинх, ВыражениеВременногоАсинх)
    ПотокВременногоАсинх = Неопределено;
    СтадияВременногоАсинх = "call";
    ПризнакОбещанияВременного = "none";
    Попытка
        ОбещаниеВременного = Вычислить(ВыражениеВременногоАсинх);
        ПризнакОбещанияВременного = ?(ТипЗнч(ОбещаниеВременного) = Тип("Обещание"), "1", "0");
        СтадияВременногоАсинх = "await";
        ПотокВременногоАсинх = Ждать ОбещаниеВременного;
        СтадияВременногоАсинх = "inspect";
        ПовторВременногоАсинх = Ждать ОбещаниеВременного;
        ИмяВременногоАсинх = Вычислить("ПотокВременногоАсинх.ИмяФайла");
        ФайлВременногоАсинх = Новый Файл(ИмяВременногоАсинх);
        ИтогВременногоАсинх = "ok|file=" + ?(ТипЗнч(ПотокВременногоАсинх) = Тип("ФайловыйПоток"), "1", "0")
            + "|repeat=" + ?(ПотокВременногоАсинх = ПовторВременногоАсинх, "1", "0")
            + "|size=" + Строка(ПотокВременногоАсинх.Размер())
            + "|position=" + Строка(ПотокВременногоАсинх.ТекущаяПозиция())
            + "|" + ?(ПотокВременногоАсинх.ДоступноЧтение, "r", "-")
            + ?(ПотокВременногоАсинх.ДоступнаЗапись, "w", "-")
            + ?(ПотокВременногоАсинх.ДоступноИзменениеПозиции, "s", "-")
            + "|exists=" + ?(ФайлВременногоАсинх.Существует(), "1", "0");
        ПотокВременногоАсинх.Закрыть();
        ПовторВременногоАсинх = Ждать ОбещаниеВременного;
        ИтогВременногоАсинх = ИтогВременногоАсинх + "|closed_repeat="
            + ?(ПотокВременногоАсинх = ПовторВременногоАсинх, "1", "0")
            + "|closed_name=" + ?(Вычислить("ПовторВременногоАсинх.FileName") = ИмяВременногоАсинх, "same", "different")
            + "|closed_exists=" + ?(ФайлВременногоАсинх.Существует(), "1", "0");
    Исключение
        ИтогВременногоАсинх = "error|" + СтадияВременногоАсинх;
        Если СтадияВременногоАсинх = "await" Тогда
            Попытка
                ПовторВременногоАсинх = Ждать ОбещаниеВременного;
                ИтогВременногоАсинх = ИтогВременногоАсинх + "|repeat=success";
            Исключение
                ИтогВременногоАсинх = ИтогВременногоАсинх + "|repeat=error";
            КонецПопытки;
        КонецЕсли;
    КонецПопытки;
    Сообщить(ИдВременногоАсинх + Символ(9) + "promise=" + ПризнакОбещанияВременного + "|" + ИтогВременногоАсинх);
    Если ПотокВременногоАсинх <> Неопределено Тогда
        Попытка ПотокВременногоАсинх.Закрыть(); Исключение КонецПопытки;
    КонецЕсли;
    Возврат Неопределено;
КонецФункции

Асинх Процедура ИзмеритьВременныйАсинх()
    Сообщить("file.begin" + Символ(9) + "temp-async-1");
    Ждать ПробаВременногоАсинх("temp.async.ru.default", "ФайловыеПотоки.СоздатьВременныйФайлАсинх()");
    Ждать ПробаВременногоАсинх("temp.async.ru.explicit", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(65535,8192)");
    Ждать ПробаВременногоАсинх("temp.async.ru.extra", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(0,0,0)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.zero", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(0)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.zero", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,0)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.one", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(1)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.one", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,1)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.eight", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.eight", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,8)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.buffer", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8192)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.buffer", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,8192)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.limit", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(65535)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.limit", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,65535)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.above", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(65536)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.above", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,65536)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.undefined", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Неопределено)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.undefined", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Неопределено)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.null", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Null)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.null", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Null)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.negative", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(-1)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.negative", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,-1)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.fraction", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(1.5)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.fraction", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,1.5)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.string", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(""8"")");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.string", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,""8"")");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.false", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Ложь)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.false", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Ложь)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.true", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Истина)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.true", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Истина)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.date", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Дата(2020,1,2))");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.date", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Дата(2020,1,2))");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.array", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Новый Массив)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.array", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Новый Массив)");
    Ждать ПробаВременногоАсинх("temp.async.ru.1.struct", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(Новый Структура)");
    Ждать ПробаВременногоАсинх("temp.async.ru.2.struct", "ФайловыеПотоки.СоздатьВременныйФайлАсинх(8,Новый Структура)");
    Ждать ПробаВременногоАсинх("temp.async.en.default", "FileStreams.CreateTempFileAsync()");
    Ждать ПробаВременногоАсинх("temp.async.en.explicit", "FileStreams.CreateTempFileAsync(65535,8192)");
    Ждать ПробаВременногоАсинх("temp.async.en.extra", "FileStreams.CreateTempFileAsync(0,0,0)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.zero", "FileStreams.CreateTempFileAsync(0)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.zero", "FileStreams.CreateTempFileAsync(8,0)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.one", "FileStreams.CreateTempFileAsync(1)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.one", "FileStreams.CreateTempFileAsync(8,1)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.eight", "FileStreams.CreateTempFileAsync(8)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.eight", "FileStreams.CreateTempFileAsync(8,8)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.buffer", "FileStreams.CreateTempFileAsync(8192)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.buffer", "FileStreams.CreateTempFileAsync(8,8192)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.limit", "FileStreams.CreateTempFileAsync(65535)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.limit", "FileStreams.CreateTempFileAsync(8,65535)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.above", "FileStreams.CreateTempFileAsync(65536)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.above", "FileStreams.CreateTempFileAsync(8,65536)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.undefined", "FileStreams.CreateTempFileAsync(Неопределено)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.undefined", "FileStreams.CreateTempFileAsync(8,Неопределено)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.null", "FileStreams.CreateTempFileAsync(Null)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.null", "FileStreams.CreateTempFileAsync(8,Null)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.negative", "FileStreams.CreateTempFileAsync(-1)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.negative", "FileStreams.CreateTempFileAsync(8,-1)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.fraction", "FileStreams.CreateTempFileAsync(1.5)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.fraction", "FileStreams.CreateTempFileAsync(8,1.5)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.string", "FileStreams.CreateTempFileAsync(""8"")");
    Ждать ПробаВременногоАсинх("temp.async.en.2.string", "FileStreams.CreateTempFileAsync(8,""8"")");
    Ждать ПробаВременногоАсинх("temp.async.en.1.false", "FileStreams.CreateTempFileAsync(Ложь)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.false", "FileStreams.CreateTempFileAsync(8,Ложь)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.true", "FileStreams.CreateTempFileAsync(Истина)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.true", "FileStreams.CreateTempFileAsync(8,Истина)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.date", "FileStreams.CreateTempFileAsync(Дата(2020,1,2))");
    Ждать ПробаВременногоАсинх("temp.async.en.2.date", "FileStreams.CreateTempFileAsync(8,Дата(2020,1,2))");
    Ждать ПробаВременногоАсинх("temp.async.en.1.array", "FileStreams.CreateTempFileAsync(Новый Массив)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.array", "FileStreams.CreateTempFileAsync(8,Новый Массив)");
    Ждать ПробаВременногоАсинх("temp.async.en.1.struct", "FileStreams.CreateTempFileAsync(Новый Структура)");
    Ждать ПробаВременногоАсинх("temp.async.en.2.struct", "FileStreams.CreateTempFileAsync(8,Новый Структура)");
    Сообщить("file.end" + Символ(9) + "temp-async-1");
    Попытка Выполнить("ЗавершитьРаботуСистемы(Ложь);"); Исключение КонецПопытки;
КонецПроцедуры

ИзмеритьВременныйАсинх();
