Процедура М(Ид, Значение)
	Сообщить(Ид + Символ(9) + Строка(Значение));
КонецПроцедуры

М("CHARS.LF", КодСимвола(Символы.ПС));
М("CHARS.CR", КодСимвола(Символы.ВК));
М("CHARS.FF", КодСимвола(Символы.ПФ));
М("CHARS.TAB", КодСимвола(Символы.Таб));
М("CHARS.VTAB", КодСимвола(Символы.ВТаб));
М("CHARS.NBSP", КодСимвола(Символы.НПП));

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.LF);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.LF", Результат);

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.CR);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.CR", Результат);

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.FF);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.FF", Результат);

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.Tab);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.TAB", Результат);

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.VTab);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.VTAB", Результат);

Результат = "ошибка";
Попытка
	Результат = КодСимвола(Chars.NBSp);
Исключение
КонецПопытки;
М("CHARS.ENGLISH.NBSP", Результат);
