МассивПробы = Новый Массив;
ПредставлениеПробы = Строка(МассивПробы);
Сообщить("ARRAY.PRESENTATION" + Символ(9) + ПредставлениеПробы);
Сообщить("ARRAY.COUNT.SELF" + Символ(9) + Строка(СтрЧислоВхождений(МассивПробы, ПредставлениеПробы)));
Сообщить("ARRAY.COUNT.EXPLICIT" + Символ(9) + Строка(СтрЧислоВхождений(ПредставлениеПробы, ПредставлениеПробы)));
Сообщить("ARRAY.COUNT.A" + Символ(9) + Строка(СтрЧислоВхождений(МассивПробы, "а")));
Сообщить("ARRAY.COMPARE.LEFT" + Символ(9) + Строка(СтрСравнить(МассивПробы, ПредставлениеПробы)));
Сообщить("ARRAY.COMPARE.RIGHT" + Символ(9) + Строка(СтрСравнить(ПредставлениеПробы, МассивПробы)));
