Попытка
    Сообщить("STARTUP=" + ПараметрыСеанса.НаблюдениеСтарта);
    Сообщить("BODY.USE=" + ?(ПараметрыСеанса.ИспользованиеРазделителяПробы, "YES", "NO"));
    Сообщить("BODY.VALUE=[" + Строка(ПараметрыСеанса.ЗначениеРазделителяПробы) + "]");
Исключение
    Сообщить("BOUND=ERROR");
КонецПопытки;
РезультатОбычногоПараметраПробы = "READABLE";
Попытка
    ОбычныйПараметрПробы = ПараметрыСеанса.ОбычныйПараметрПробы;
Исключение
    РезультатОбычногоПараметраПробы = ?(СтрНайти(ОписаниеОшибки(), "ordinary-request:ОбычныйПараметрПробы") > 0, "SELECTIVE_ERROR", "OTHER_ERROR");
КонецПопытки;
Сообщить("ORDINARY=" + РезультатОбычногоПараметраПробы);
