Попытка
    ПользовательАдминистратораПробы = ПользователиИнформационнойБазы.СоздатьПользователя();
    ПользовательАдминистратораПробы.Имя = "ControlAdmin";
    ПользовательАдминистратораПробы.АутентификацияСтандартная = Истина;
    ПользовательАдминистратораПробы.Роли.Добавить(Метаданные.Роли.ControlAdmin);
    ПользовательАдминистратораПробы.Записать();
    ПользовательЧтенияПробы = ПользователиИнформационнойБазы.СоздатьПользователя();
    ПользовательЧтенияПробы.Имя = "ControlRead";
    ПользовательЧтенияПробы.АутентификацияСтандартная = Истина;
    ПользовательЧтенияПробы.Роли.Добавить(Метаданные.Роли.ControlRead);
    ПользовательЧтенияПробы.Записать();
    Сообщить("setup.users" + Символ(9) + "created");
Исключение
    Сообщить("setup.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
