Попытка
    ПользовательОбъединенияПробы = ПользователиИнформационнойБазы.НайтиПоИмени("ControlMulti");
    Если ПользовательОбъединенияПробы = Неопределено Тогда
        ПользовательОбъединенияПробы = ПользователиИнформационнойБазы.СоздатьПользователя();
        ПользовательОбъединенияПробы.Имя = "ControlMulti";
        ПользовательОбъединенияПробы.АутентификацияСтандартная = Истина;
        ПользовательОбъединенияПробы.Роли.Добавить(Метаданные.Роли.ControlRead);
        ПользовательОбъединенияПробы.Роли.Добавить(Метаданные.Роли.ControlExtra);
        ПользовательОбъединенияПробы.Записать();
        Сообщить("setup.multi" + Символ(9) + "created");
    Иначе
        Сообщить("setup.multi" + Символ(9) + "already-exists");
    КонецЕсли;
Исключение
    Сообщить("setup.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
