Попытка
    ОбъектПометкиПробы = ПланыВидовХарактеристик.ЗамерХарактеристик.СоздатьЭлемент();
    Сообщить("characteristic.deletion.body" + Символ(9) + ОбъектПометкиПробы.СледПробы());
    Сообщить("characteristic.deletion.initial" + Символ(9) + ?(ОбъектПометкиПробы.ПометкаУдаления, "1", "0"));
    ОбъектПометкиПробы.ПометкаУдаления = Истина;
    Сообщить("characteristic.deletion.alias" + Символ(9) + ?(ОбъектПометкиПробы.DeletionMark, "1", "0"));
    ОбъектПометкиПробы.ИзменитьПометкуПробы(Ложь);
    Сообщить("characteristic.deletion.own" + Символ(9) + ?(ОбъектПометкиПробы.ПометкаПробы(), "1", "0"));
    ОбъектПометкиПробы.DeletionMark = 1;
    Сообщить("characteristic.deletion.number" + Символ(9) + ?(ОбъектПометкиПробы.ПометкаУдаления, "1", "0"));
    Сообщить("characteristic.deletion.other" + Символ(9) + ?(ПланыВидовХарактеристик.ЗамерХарактеристик.СоздатьЭлемент().DeletionMark, "1", "0"));
Исключение
    Сообщить("characteristic.deletion.error" + Символ(9) + ОписаниеОшибки());
КонецПопытки;
