Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

Файл = Новый ЗаписьТекста("test.csv");
Данные = Новый Структура(
    "d1,d2,d3,d4,d5,d6,d7,d8,d9,d10,d11,d12,d13,d14,d15,d16,d17,d18,d19,d20",
    "1", "2", "3", "4", "5", "6", "7", "8", "9", "10",
    "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"
);
Разделитель = ";";
НоваяСтрока = Символ(10);

Для i = 0 По 300000 Цикл
    Файл.Записать(Данные.d1);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d2);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d3);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d4);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d5);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d6);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d7);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d8);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d9);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d10);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d11);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d12);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d13);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d13);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d14);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d15);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d16);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d17);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d18);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d19);
    Файл.Записать(Разделитель);
    Файл.Записать(Данные.d20);
    Файл.Записать(НоваяСтрока);
КонецЦикла;

Файл.Закрыть();
Сообщить(
    "elapsed time: "
    + Строка((ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000)
    + " seconds"
);
