ЗначениеКодировкиПробы = КодировкаИменФайловВZipФайле.КодировкаОСДополнительноUTF8;
Сообщить("zip.os-utf8.presentation" + Символ(9) + Строка(ЗначениеКодировкиПробы));
Сообщить("zip.os-utf8.type" + Символ(9) + Строка(ТипЗнч(ЗначениеКодировкиПробы)));
Сообщить("zip.os-utf8.alias" + Символ(9) + ?(ЗначениеКодировкиПробы = FileNamesEncodingInZipFile.OSEncodingWithUTF8, "1", "0"));
Сообщить("zip.os-utf8.auto" + Символ(9) + ?(ЗначениеКодировкиПробы = КодировкаИменФайловВZipФайле.Авто, "1", "0"));
Сообщить("zip.os-utf8.utf8" + Символ(9) + ?(ЗначениеКодировкиПробы = КодировкаИменФайловВZipФайле.UTF8, "1", "0"));
