Попытка
    ПробаХарактеристики = ПланыВидовХарактеристик.ЗамерХарактеристик.СоздатьЭлемент();
    Сообщить("characteristic.body.receipt=" + ПробаХарактеристики.ПрочитатьПротоколТела());
    Сообщить("characteristic.body.types.after=" + Строка(ПробаХарактеристики.ТипЗначения.Типы().Количество()));
    Сообщить("characteristic.body.new.after=" + Строка(?(ПробаХарактеристики.ЭтоНовый(), 1, 0)));
    Сообщить("characteristic.body.description.after=" + ПробаХарактеристики.Наименование);
Исключение
    Сообщить("characteristic.body.error=" + ОписаниеОшибки());
КонецПопытки;
