Перем ПротоколТела;
Функция ПрочитатьПротоколТела() Экспорт
    Возврат ПротоколТела;
КонецФункции
ПротоколТела = "";
Попытка
    ПротоколТела = ПротоколТела + "code=" + Код + ";";
Исключение
    ПротоколТела = ПротоколТела + "code=ERROR;";
КонецПопытки;
Попытка
    ПротоколТела = ПротоколТела + "description=" + Наименование + ";";
Исключение
    ПротоколТела = ПротоколТела + "description=ERROR;";
КонецПопытки;
Попытка
    ПротоколТела = ПротоколТела + "types=" + Строка(ТипЗначения.Типы().Количество()) + ";";
Исключение
    ПротоколТела = ПротоколТела + "types=ERROR;";
КонецПопытки;
Попытка
    Наименование = "body";
    ПротоколТела = ПротоколТела + "write=OK;";
Исключение
    ПротоколТела = ПротоколТела + "write=ERROR;";
КонецПопытки;
Попытка
    ПротоколТела = ПротоколТела + "new=" + Строка(?(ЭтоНовый(), 1, 0)) + ";";
Исключение
    ПротоколТела = ПротоколТела + "new=ERROR;";
КонецПопытки;
